from flask import Flask, request, abort
from flask_cors import CORS
import joblib
import dotenv
import re
import requests

app = Flask(__name__)
cors = CORS(app)

channel_access_token = 'bnuW8Pa848Dfhp37AA0II+V8EYcHNGjc5IwlNhvoxLzUmMW1FoKA/xWjaLpRibuRCemzQSXWKLeMTS02UXXViLX/7Fpj1iZiqpPZyOpZowrLMpCgvT6s1Dt04b9eRR7MbZEKSiMHNJEIARLEfYTx4QdB04t89/1O/w1cDnyilFU='

model = joblib.load("./RandomForestClassifier.joblib")
vectoriser = joblib.load("./count_vec.pkl")

Olabel = {-1: 'NC', 0: 'ถอนฟัน', 1: 'ผ่าฟันคุด', 2: 'ผ่าตัดเหงือก', 3: 'ผ่าตัดรากฟันเทียม'}
Qlabel = {0: "General Health", 1: "Medication Related", 2: "Post-Procedure Care", 3: "Procedure Related", 4: "Risk-Related", 5: "Symptom Related", 6: "Technical"}

contexts = {
    "ถอนฟัน" : {
        "General Health": "ก่อนถอนฟันควรปรึกษาทันตแพทย์ก่อนถอนฟันทุกครั้งเพื่อประเมินสภาพและความจำเป็นในการถอนฟัน การถอนฟันในทางทันตกรรมหมายถึงการนำฟันออกจากเบ้าฟันโดยกระบวนการทางศัลยกรรม การถอนฟันคือกระบวนการนำฟันซี่ที่มีปัญหาร้ายแรงออกจากเบ้าฟัน การถอนฟันเป็นวิธีการรักษาทางทันตกรรมโดยนำฟันซี่ที่ไม่สามารถรักษาให้ใช้งานได้ออกจากเบ้าฟัน การถอนฟันมีข้อด้อยเช่น อาจมีเลือดออก บวม เสี่ยงติดเชื้อหลังถอน ต้องใช้เวลาฟื้นฟู และอาจส่งผลต่อการบดเคี้ยว/รูปลักษณ์ฟันชั่วคราว ถอนฟันทีละซี่หรือถอนทีเดียวจะทรมานน้อยกว่าจะขึ้นอยู่กับการพิจารณาของทันตแพทย์ หากปฏิบัติตามคำแนะนำอย่างระมัดระวังแผลจากการถอนฟันส่วนใหญ่จะหายเองภายในระยะเวลา 7-10 วันได้เป็นปกติ การถอนฟันช่วยป้องกันการระบายเชื้อโรคได้เพราะเมื่อถอนฟันที่มีปัญหาออกไปแล้วจะช่วยกำจัดแหล่งเชื้อโรคและป้องกันการแพร่กระจายของเชื้อโรค การถอนฟันช่วยป้องกันการติดเชื้อ ลดความเจ็บปวด ทำให้บดเคี้ยวอาหารได้ดีขึ้น และป้องกันปัญหาร้ายแรงอื่นๆจากฟันที่มีปัญหา การถอนฟันมีประโยชน์เนื่องจากเป็นวิธีแก้ไขฟันที่มีปัญหาร้ายแรงและไม่สามารถรักษาให้ใช้งานต่อไปได้ การถอนฟันมีข้อดีต่างๆเช่น กำจัดแหล่งเชื้อโรค ลดความเจ็บปวด เปิดพื้นที่สำหรับทำฟันปลอม ถ้าฟันมีปัญหาร้ายแรงแล้วไม่ถอนออก อาจทำให้เกิดการติดเชื้อลุกลามไปยังบริเวณอื่นๆ ส่งผลกระทบต่อสุขภาพโดยรวมเมื่อฟันนั้นมีปัญหาร้ายแรงจนไม่สามารถรักษาให้ใช้งานต่อไปได้ ข้อควรระวังหลังการถอนฟันต้องดูแลแผลถอนฟันให้สะอาดและปฏิบัติตามคำแนะนำอย่างเคร่งครัดเพื่อป้องกันภาวะแทรกซ้อน ถอนฟันจำเป็นต้องทำในกรณีที่ฟันเสียหายหนักเช่นฟันผุมาก ฟันหักหรือแตกจนรากฟันไม่สามารถยึดฟันได้ รากฟันเกิดการติดเชื้อรุนแรง หรือฟันคุดซึ่งหากปล่อยทิ้งไว้จะทำให้เกิดปัญหารุนแรงถึงขั้นเป็นอันตรายต่อสุขภาพ การถอนฟันจึงเป็นสิ่งจำเป็นเพื่อป้องกันปัญหาที่รุนแรงขึ้น การถอนฟันของทันตแพทย์ในกรณีปกติมักจะไม่ทำให้เจ็บปวดอย่างรุนแรง เพียงแต่อาจรู้สึกไม่สบายบริเวณที่ถอนฟันในระยะสั้นๆเท่านั้น หากปฏิบัติตามคำแนะนำของทันตแพทย์อย่างเคร่งครัด อาการปวดและบวมจะค่อยๆดีขึ้นภายในไม่กี่วัน",
        "Medication Related": "โดยปกติการถอนฟันจะต้องฉีดยาชาที่บริเวณรอบๆฟันที่จะถอน เพื่อระงับความรู้สึกปวดและทำให้การถอนฟันราบรื่นขึ้น ยกเว้นกรณีที่เป็นการถอนฟันน้ำนม จำนวนเข็มยาชาขึ้นอยู่กับตำแหน่งและจำนวนฟันที่ต้องถอน โดยปกติจะใช้ประมาณ 1-2 เข็มสำหรับการถอนฟันเพียงซี่เดียว แต่หากต้องถอนหลายซี่ จำนวนเข็มอาจเพิ่มขึ้น หลังจากผลของยาชาหมดไป มักจะรู้สึกปวดบวมบริเวณที่ถอนฟัน ดังนั้นทันตแพทย์มักจะสั่งจ่ายยาแก้ปวดชนิดกินเพื่อบรรเทาอาการดังกล่าว โดยทั่วไปแล้วจะต้องกินยาแก้ปวดเป็นเวลาประมาณ 3-5 วันหลังถอนฟัน หรือจนกว่าอาการปวดและบวมจะทุเลา แต่ควรทานตามคำแนะนำของทันตแพทย์ หลังถอนฟันในช่วงแรกๆนั้น มักจะเจ็บปวดและบวมบริเวณรอบๆแผล ทันตแพทย์จึงมักจะสั่งยาแก้ปวดชนิดกินเพื่อบรรเทาอาการดังกล่าว เช่น พาราเซตามอล อิบูโพรเฟน เป็นต้น",
        "Technical": "กรณีถอนฟันแล้วการทำรากฟันเทียมหรือไม่ขึ้นอยู่กับสถานการณ์หากเป็นการถอนฟันซี่เดียวอาจไม่จำเป็นต้องทำรากฟันเทียมแต่ถ้าเป็นการถอนฟันหลายซี่ ทันตแพทย์อาจแนะนำให้ทำรากฟันเทียมเพื่อทดแทนฟันที่ถอนออกไป โดยทั่วไปไม่จำเป็นต้องงดอาหารก่อนถอนฟันแต่ควรหลีกเลี่ยงอาหารที่มีกากแข็งๆในช่วงสองสามชั่วโมงก่อนนัด ก่อนถอนฟันต้องแปรงฟันให้สะอาดและงดสูบบุหรี่ชั่วคราว ข้อห้ามก่อนการถอนฟันเช่น ไม่ควรดื่มแอลกอฮอล์ก่อนถอนฟัน งดยาต้านการแข็งตัวของเลือดบางชนิดตามคำแนะนำของทันตแพทย์ ทั่วไปมักไม่จำเป็นต้องใส่ฟันปลอมทันทีหลังถอนฟันหากเป็นการถอนฟันซี่เดียว อย่างไรก็ตามหากเป็นการถอนฟันหลายซี่ทันตแพทย์อาจแนะนำให้ใส่ฟันปลอมเพื่อทดแทนฟันที่ถูกถอนออกเนื่องจากจะช่วยบดเคี้ยวได้ดีขึ้น และป้องกันไม่ให้ฟันอื่นๆ เคลื่อนตัว ในกรณีที่ฟันผุยังไม่รุนแรงมากนักสามารถกรอบริเวณที่ผุออกแล้วอุดฟันได้เพื่อหลีกเลี่ยงการถอนฟันแต่หากฟันผุมากเกินไปอาจจำเป็นต้องถอนฟันเพื่อป้องกันปัญหาเรื้อรัง หากกัดผ้าก๊อซแล้วยังมีเลือดซึมออกมาให้นำผ้าก๊อซชิ้นใหม่มากดที่บริเวณแผลถอนฟันประมาณ30นาทีหากเลือดยังไม่หยุดอาจต้องกลับไปพบทันตแพทย์เพื่อรับการรักษาต่อ หลังถอนฟันควรกัดผ้าก๊อซให้แน่นที่บริเวณแผลเป็นเวลาประมาณ1ชั่วโมงเพื่อให้เลือดแข็งตัวและหยุดไหล ไม่จำเป็นต้องเปลี่ยนผ้าก๊อซบ่อยนัก แต่หากผ้าก๊อซเปื้อนเลือดมากก็ควรเปลี่ยนใหม่ทุก1-2ชั่วโมงจนกระทั่งเลือดหยุดไหล ไม่ควรใส่รีเทนเนอร์ในช่วงแรกหลังถอนฟันประมาณ1-2วันเนื่องจากอาจกดทับบริเวณแผลได้ควรรอจนแผลเริ่มแห้งก่อนแล้วจึงค่อยใส่รีเทนเนอร์ตามปกติ อาหารที่ควรหลีกเลี่ยงก่อนถอนฟันเช่น อาหารแข็ง อาหารร้อนจัด อาหารที่เป็นกรด เครื่องดื่มกาแฟ เครื่องดื่มแอลกอฮอล์",
        "Post-Procedure Care": "ข้อควรพึงระวังหลังจากถอนฟัน เช่น อย่างัดกระทืบผ้าก๊อซ ให้กัดผ้าก๊อซเบาๆ หลีกเลี่ยงการดูดหรือการบ้วนปากแรงๆในวันแรก ข้อควรระวังหลังถอนฟันมีอะไรบ้าง กัดผ้าก๊อซที่บริเวณแผลเบาๆ นาน 30-60 นาที เพื่อช่วยหยุดเลือด ใช้ผ้าเย็นประคบบริเวณแก้มเพื่อลดบวมในวันแรกหลังถอนฟัน แปรงฟันตามปกติแต่ระวังไม่ให้ถูกบริเวณแผลโดยตรง รับประทานยาแก้ปวดและยาปฏิชีวนะตามคำแนะนำของทันตแพทย์ ในการดูแลแผลหลังการถอนฟันควรรักษาความสะอาดช่องปากตามปกติแต่ระวังบริเวณแผล แนะนำให้ประคบเย็นในช่วง24ชั่วโมงแรกหลังถอนฟันโดยใช้ถุงน้ำแข็งหรือผ้าเปียกเย็นประคบบริเวณแก้มด้านนอกเพื่อลดอาการบวมและปวด หลังจากนั้นจึงค่อยสลับไปประคบด้วยความร้อนเพื่อบรรเทาอาการปวดเรื้อรัง หลังถอนฟัน6-8ชั่วโมงแรกไม่ควรรับประทานอาหารแข็งเนื่องจากอาจทำให้เกิดเลือดออกและแผลฉีกขาดได้ หลังจากนั้นสามารถรับประทานข้าวหรืออาหารอ่อนนุ่มได้ ในช่วง24ชั่วโมงแรกควรหลีกเลี่ยงการแปรงฟันในบริเวณแผล แต่ให้แปรงฟันได้ตามปกติในบริเวณอื่นหลังจากนั้นก็สามารถแปรงได้ตามปกติ แต่ต้องระมัดระวังไม่ให้แปรงถูกบริเวณแผลโดยตรง ไม่ควรดื่มเครื่องดื่มแอลกอฮอล์หลังถอนฟันทันที เนื่องจากแอลกอฮอล์จะทำให้ร่างกายขาดน้ำ ชะลอการหายของแผล และเพิ่มความเสี่ยงต่อการติดเชื้อ แนะนำควรงดดื่มแอลกอฮอล์อย่างน้อย3วันหลังถอนฟัน หลังถอนฟันในช่วง24ชั่วโมงแรกไม่ควรดื่มน้ำร้อนหรือรับประทานอาหารร้อนเนื่องจากอาจทำให้เกิดการบาดเจ็บต่อแผล และเสี่ยงต่อการติดเชื้อ หลังจาก24ชม.แล้วสามารถดื่มน้ำอุ่นๆได้ แต่ควรระวังไม่ให้ร้อนจนเกินไป หลังถอนฟันควรงดรับประทานอาหารรสเผ็ดร้อนประมาณ3-5วันเนื่องจากจะทำให้บริเวณแผลระคายเคืองและชักนำให้เกิดการติดเชื้อได้ง่าย หลังถอนฟัน24ชั่วโมงแรกไม่ควรแปรงฟันบริเวณแผลเพื่อป้องกันการฉีกขาดของแผลและการติดเชื้อ สามารถแปรงฟันบริเวณอื่นได้ตามปกติ หลังจากนั้นสามารถแปรงได้ทุกบริเวณ แต่ต้องระมัดระวังและแปรงเบามือที่บริเวณแผล ถอนฟันแล้วไม่ควรกินอาหารร้อนหรือเผ็ดเนื่องจากบริเวณที่ถอนฟันจะมีแผลเปิดและสัมผัสกับความร้อนหรือรสเผ็ดจะทำให้เกิดการระคายเคือง ปวด บวม และเสี่ยงต่อการติดเชื้อมากขึ้นจึงควรหลีกเลี่ยงอาหารประเภทนี้ชั่วคราวหลังถอนฟัน วิธีการป้องกันการติดเชื้อหลังถอนฟันคือรับประทานยาปฏิชีวนะตามคำสั่งของทันตแพทย์ รักษาความสะอาดบริเวณแผลด้วยการบ้วนปากด้วยน้ำเกลือเป็นประจำ งดสูบบุหรี่และดื่มแอลกอฮอล์ชั่วคราว หลีกเลี่ยงการใช้หลอดดูดของเหลวหรือให้ลมรั่วผ่านบริเวณแผล วิธีลดความปวดหลังถอนฟันคือรับประทานยาแก้ปวดตามคำสั่งของทันตแพทย์ เวลาในการฟื้นตัวหลังการถอนฟัน ระยะเวลาเฉลี่ยในการฟื้นตัวคือประมาณ3-4วัน หลังจากนั้นอาการปวดและบวมควรทุเลา แต่แผลใช้เวลาหายสนิทประมาณ2สัปดาห์ หลังถอนฟันถ้ามีเลือดออกในปากควรจะกลืนหรือบ้วนทิ้ง หากเลือดไม่หยุดซึมออกมานานเกิน30นาทีควรรีบกลับไปพบทันตแพทย์เพื่อตรวจสอบและรักษาต่อ",
        "Risk-Related": "การถอนฟันมีความเสี่ยงในการติดเชื้อ เลือดออกมาก และบาดเจ็บเนื้อเยื่อรอบฟัน การถอนฟันมีผลกระทบด้านการสูญเสียฟัน อาจทำให้ฟันเคลื่อนตัว และส่งผลต่อการบดเคี้ยวอาหาร การถอนฟันสามารถทำให้เกิดปัญหาการติดเชื้อ เลือดออกมาก บาดเจ็บเนื้อเยื่อ และฟันเคลื่อนตัวได้ การถอนฟันไม่ได้อันตรายมากนัก แต่มีความเสี่ยงบางประการหากไม่ได้รับการดูแลที่ถูกต้อง อาจทำให้เกิดการติดเชื้อ เลือดออกมาก บาดเจ็บเนื้อเยื่อ หรือแม้แต่กระดูกขากรรไกรหัก ปัญหาที่พบได้บ่อยภายหลังการถอนฟัน ได้แก่ การติดเชื้อบริเวณรอยถอน เลือดออกไม่หยุด บาดเจ็บ/อักเสบเนื้อเยื่อโดยรอบ และฟันข้างเคียงเคลื่อนตัว หลังจากถอนฟันสามารถพบอาการข้างเคียง เช่น บวม ปวด เจ็บ เลือดออก คลำได้รอยถอนฟัน รสเลือดในปาก ฟันข้างเคียงเคลื่อนตัว เป็นต้น",
        "Procedure Related": "การถอนฟันกรามซี่เดียวใช้เวลาประมาณ20-40นาที ถ้าเป็นฟันล่างที่มีรากฟันใหญ่ อาจใช้เวลานานกว่า 1 ชั่วโมง จะมีความปวดระหว่างการถอนฟัน แม้จะฉีดยาชาเข้าไปแล้ว แต่ผู้ป่วยอาจยังรู้สึกถึงแรงกดหรือดึง รวมถึงความไม่สบายในระหว่างถอนฟัน แต่โดยทั่วไปจะไม่รู้สึกปวดระหว่างการรักษา การถอนฟันมีความจำเป็นมากน้อยขนาดไหน: การถอนฟันมีความจำเป็นมากน้อยขนาดไหน การตัดสินใจถอนฟันขึ้นอยู่กับสภาพของฟันและสุขภาพช่องปากโดยรวม หากสามารถอนุรักษ์ฟันไว้ได้โดยการอุด ครอบ หรือขูดหินปูนก็ควรเลือกทางเลือกนี้ก่อน แต่ถ้าฟันผุมากเกินไป ฟันหัก หรือโรคปริทันต์รุนแรง การถอนฟันก็เป็นทางเลือกสุดท้าย ขั้นตอนการถอนฟัน ฉีดยาชาเฉพาะที่ ใช้คีมคู่หนีบจับยึดฟันให้แน่น แล้วขยับฟันเพื่อคลายรากฟันออกจากเบ้าฟัน ดึงฟันขึ้นทีละน้อย โดยระวังอย่าให้ฟันแตกหัก ทำความสะอาดเนื้อเยื่อบริเวณที่มีการถอนฟัน กดผ้าก๊อซที่บริเวณแผลเพื่อหยุดเลือด ไม่แนะนำให้ถอนฟันเองเพราะจะทำให้เกิดความเสี่ยงต่อการบาดเจ็บ เลือดออกมาก รากฟันหัก หรือเกิดการติดเชื้อได้ การถอนฟันควรทำโดยผู้เชี่ยวชาญภายใต้สภาวะที่ถูกสุขลักษณะเท่านั้น",
        "Symptom Related": "กลิ่นปากเหม็นหลังถอนฟันเกิดจากการติดเชื้อและเศษอาหารค้างในรอยถอนฟัน หากไม่ดูแลรักษาความสะอาดอย่างถูกวิธี ทันตแพทย์จะแนะนำให้ถอนฟันเมื่อฟันเสียจนซ่อมแซมไม่ได้แล้ว หรือเป็นภัยต่อฟันอื่นๆเพื่อป้องกันปัญหาเพิ่มมากขึ้น สาเหตุที่ต้องถอนฟันมีหลายประการ เช่น ฟันผุรุนแรง ปริทันต์อักเสบ ฟันคุด ฟันเบียดกันมาก เพื่อรักษาโรคในช่องปาก เพื่อการจัดฟัน หรือเตรียมการใส่ฟันปลอม แผลถอนฟันจะเจ็บประมาณ 3-4 วันแรกจากนั้นความเจ็บปวดจะค่อยๆลดลง แม้จะปวดฟันไม่จำเป็นต้องถอนฟันทักที หากยังรักษาหรือซ่อมฟันได้ควรพยายามรักษาฟันให้คงอยู่ก่อน แผลถอนฟันจะแห้งและหายเป็นแผลเป็นประมาณ 7-10 วัน หากดูแลรักษาความสะอาดเรียบร้อย ต้องถอนฟันเมื่อฟันผุลามไปจนถึงรากฟัน หรือมีการอักเสบที่รุนแรง ซ่อมแซมไม่ได้แล้ว"    
    }
}

def keyword_Search3(question):
    returnClass = []
    question = question.lower()
    question = question.replace('?', '')
    question = question.replace(' ', '')
    
    class_0_regex = r'(?!.*(.).*\1)[ถอนฟัน]{6}|ถ.นฟัน|ถอ.ฟัน|ถอน.น|อนฟัน|ถนฟัน|ถอฟัน|ถอนฟั|ถ.อนฟัน|ถอ.นฟัน|ถอน.ฟัน|ถอนฟั.น|ถน|ถ.อน|ถอ.น|ถอน'
    class_1_regex = r'(?!.*(.).*\1)[ฟันคุด]{6}|.นคุด|ฟั.คุด|ฟันคุ.|ฟั.นคุด|ฟัน.คุด|ฟันคุ.ด|ฟัคุด|ฟันคด|ฟนคุด|นคุด|ฟันคุ'
    class_2_regex = r'[เหงือก]{6}|.หงือก|เ.งือก|เห.อก|เหงื.ก|เหงือ.|เ.หงือก|เห.งือก|เหงื.อก|เหงือ.ก|เงือก|เหงอก|เหือก|เหงืก|หงือก|[ปริทันต์]{8}|.ริทันต์|ป.ทันต์|ปริ.นต์|ปริทั.ต์|ปริทัน.|ป.ริทันต์|ปริ.ทันต์|ปริทั.นต์|ปริทัน.ต์|ปรทันต์|ปิทันต์|ปริทนต์|ปริทันต|ปริทัน|ริทันต์'
    class_3_regex = r'(?!การ|รัก|กัน)(?!.*(.).*\1)[รากฟัน]{6}|รกาฟัน|ราฟกัน|ร.กฟัน|รา.ฟัน|ราก.น|รากฟั.|ร.ากฟัน|รา.กฟัน|ราก.ฟัน|รากฟั.น|รกฟัน|ราฟัน|รากน|รากฟั|[รากเทียม]{8}|.ากเทียม|ร.กเทียม|รา.เทียม|ราก.ทียม|รากเ.ยม|รากเที.ม|รากเทีย.|ร.ากเทียม|รา.กเทียม|ราก.เทียม|รากเ.ทียม|รากเที.ยม|รากเทีย.ม|ากเทียม|รกเทียม|รากทียม|รากเยม|รากเทีม|ากฟันเทียม'
    
    if re.search(class_1_regex, question):
        returnClass.append(1)
    
    if re.search(class_0_regex, question) and not re.search(class_1_regex, question):
        returnClass.append(0)
    
    if re.search(class_2_regex, question):
        returnClass.append(2)
    
    if re.search(class_3_regex, question):
        returnClass.append(3)
        
    if len(returnClass) != 1:
        returnClass = [-1]
        
    return returnClass[0]

@app.route("/")
def home():
    return "Model Server is running on port 5000."

@app.route("/line", methods=["POST"])
def line():
    body_json = request.get_json()
    app.logger.info(body_json)
    
    try:
        handle_message(body_json)
    except:
        abort(400)

    return 'OK'

def query(payload):
    response = requests.post("https://api-inference.huggingface.co/models/timpal0l/mdeberta-v3-base-squad2", 
                            headers={"Authorization": "Bearer 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"}, 
                            json=payload)
    return response.json()    

def handle_message(body_json):
    operation = keyword_Search3(body_json['events'][0]['message']['text'])

    if operation == -1:
        requests.post('https://api.line.me/v2/bot/message/reply',
                  headers={'Content-Type': 'application/json', 'Authorization' : f'Bearer {channel_access_token}'},
                    json = { "replyToken":  body_json['events'][0]['replyToken'],
                            "messages": [{"type": "text", "text": "Sorry, Please specify the operation(ถอนฟัน, ผ่าฟันคุด, ผ่าตัดเหงือก, ผ่าตัดรากฟันเทียม) in the question."}]
                })
        return

    data = vectoriser.transform([body_json['events'][0]['message']['text']])
    prediction = model.predict(data)
    text = str(f"Operation: {Olabel[operation]}\nQuestion Type: {Qlabel[prediction[0]]}")
    
    if Olabel[operation] in contexts.keys():
        output = query({
            "inputs": {
                "question": body_json['events'][0]['message']['text'],
                "context":  contexts[Olabel[operation]][Qlabel[prediction[0]]],
            },
        })
        text += f"\nAnswer: {output['answer']}"

    requests.post('https://api.line.me/v2/bot/message/reply',
                  headers={'Content-Type': 'application/json', 'Authorization' : f'Bearer {channel_access_token}'},
                    json = { "replyToken":  body_json['events'][0]['replyToken'],
                            "messages": [{"type": "text", "text": text}]
                })
    return

@app.route("/predict", methods=["POST"])
def predict():
    
    data = request.json
    input_text = data['question']
    
    operation = keyword_Search3(input_text)
    
    if operation == -1:
        return  {'answer': "Sorry, Please specify the operation(ถอนฟัน, ผ่าฟันคุด, ผ่าตัดเหงือก, ผ่าตัดรากฟันเทียม) in the question."}

    data = vectoriser.transform([input_text])
    prediction = model.predict(data)
    
    if Olabel[operation] in contexts.keys(): 
        output = query({
            "inputs": {
                "question": input_text,
                "context":  contexts[Olabel[operation]][Qlabel[prediction[0]]],
            },
        })

    return {'question': input_text, 'operation': Olabel[operation], 'question_type': Qlabel[prediction[0]], 'answer': output['answer'], 'score': output['score']}

if __name__ == "__main__":
    context = ('../certificates/localhost.pem', '../certificates/localhost-key.pem')
    app.run(host=dotenv.get_key("../.env","REACT_APP_DNS_NAME"), port=dotenv.get_key("../.env","MODEL_PORT"),debug = True,ssl_context=context)