import datetime
from flask import Flask, request, abort
from flask_cors import CORS
import joblib
import dotenv
import pytz
import requests
import re
from flask_pymongo import PyMongo
from apscheduler.schedulers.background import BackgroundScheduler

app = Flask(__name__)
app.config["MONGO_URI"] = dotenv.get_key("../.env", 'MONGO_URI')
cors = CORS(app)
mongo = PyMongo(app)

model = joblib.load("./RandomForestClassifier.joblib")
vectoriser = joblib.load("./count_vec.pkl")

Olabel = {-1: 'NC', 0: 'ถอนฟัน', 1: 'ผ่าฟันคุด', 2: 'ผ่าตัดเหงือก', 3: 'ผ่าตัดรากฟันเทียม'}
Qlabel = {0: "General Health", 1: "Medication Related", 2: "Post-Procedure Care", 3: "Procedure Related", 4: "Risk-Related", 5: "Symptom Related", 6: "Technical"}

contexts = {
       "ถอนฟัน" : {
        "General Health": "ก่อนถอนฟันควรปรึกษาทันตแพทย์ก่อนถอนฟันทุกครั้งเพื่อประเมินสภาพและความจำเป็นในการถอนฟัน การถอนฟันในทางทันตกรรมหมายถึงการนำฟันออกจากเบ้าฟันโดยกระบวนการทางศัลยกรรม การถอนฟันคือกระบวนการนำฟันซี่ที่มีปัญหาร้ายแรงออกจากเบ้าฟัน การถอนฟันเป็นวิธีการรักษาทางทันตกรรมโดยนำฟันซี่ที่ไม่สามารถรักษาให้ใช้งานได้ออกจากเบ้าฟัน การถอนฟันมีข้อด้อยเช่น อาจมีเลือดออก บวม เสี่ยงติดเชื้อหลังถอน ต้องใช้เวลาฟื้นฟู และอาจส่งผลต่อการบดเคี้ยว/รูปลักษณ์ฟันชั่วคราว ถอนฟันทีละซี่หรือถอนทีเดียวจะทรมานน้อยกว่าจะขึ้นอยู่กับการพิจารณาของทันตแพทย์ หากปฏิบัติตามคำแนะนำอย่างระมัดระวังแผลจากการถอนฟันส่วนใหญ่จะหายเองภายในระยะเวลา 7-10 วันได้เป็นปกติ การถอนฟันช่วยป้องกันการระบายเชื้อโรคได้เพราะเมื่อถอนฟันที่มีปัญหาออกไปแล้วจะช่วยกำจัดแหล่งเชื้อโรคและป้องกันการแพร่กระจายของเชื้อโรค การถอนฟันช่วยป้องกันการติดเชื้อ ลดความเจ็บปวด ทำให้บดเคี้ยวอาหารได้ดีขึ้น และป้องกันปัญหาร้ายแรงอื่นๆจากฟันที่มีปัญหา การถอนฟันมีประโยชน์เนื่องจากเป็นวิธีแก้ไขฟันที่มีปัญหาร้ายแรงและไม่สามารถรักษาให้ใช้งานต่อไปได้ การถอนฟันมีข้อดีต่างๆเช่น กำจัดแหล่งเชื้อโรค ลดความเจ็บปวด เปิดพื้นที่สำหรับทำฟันปลอม ถ้าฟันมีปัญหาร้ายแรงแล้วไม่ถอนออก อาจทำให้เกิดการติดเชื้อลุกลามไปยังบริเวณอื่นๆ ส่งผลกระทบต่อสุขภาพโดยรวมเมื่อฟันนั้นมีปัญหาร้ายแรงจนไม่สามารถรักษาให้ใช้งานต่อไปได้ ข้อควรระวังหลังการถอนฟันต้องดูแลแผลถอนฟันให้สะอาดและปฏิบัติตามคำแนะนำอย่างเคร่งครัดเพื่อป้องกันภาวะแทรกซ้อน ถอนฟันจำเป็นต้องทำในกรณีที่ฟันเสียหายหนักเช่นฟันผุมาก ฟันหักหรือแตกจนรากฟันไม่สามารถยึดฟันได้ รากฟันเกิดการติดเชื้อรุนแรง หรือฟันคุดซึ่งหากปล่อยทิ้งไว้จะทำให้เกิดปัญหารุนแรงถึงขั้นเป็นอันตรายต่อสุขภาพ การถอนฟันจึงเป็นสิ่งจำเป็นเพื่อป้องกันปัญหาที่รุนแรงขึ้น การถอนฟันของทันตแพทย์ในกรณีปกติมักจะไม่ทำให้เจ็บปวดอย่างรุนแรง เพียงแต่อาจรู้สึกไม่สบายบริเวณที่ถอนฟันในระยะสั้นๆเท่านั้น หากปฏิบัติตามคำแนะนำของทันตแพทย์อย่างเคร่งครัด อาการปวดและบวมจะค่อยๆดีขึ้นภายในไม่กี่วัน",
        "Medication Related": "โดยปกติการถอนฟันจะต้องฉีดยาชาที่บริเวณรอบๆฟันที่จะถอน เพื่อระงับความรู้สึกปวดและทำให้การถอนฟันราบรื่นขึ้น ยกเว้นกรณีที่เป็นการถอนฟันน้ำนม จำนวนเข็มยาชาขึ้นอยู่กับตำแหน่งและจำนวนฟันที่ต้องถอน โดยปกติจะใช้ประมาณ 1-2 เข็มสำหรับการถอนฟันเพียงซี่เดียว แต่หากต้องถอนหลายซี่ จำนวนเข็มอาจเพิ่มขึ้น หลังจากผลของยาชาหมดไป มักจะรู้สึกปวดบวมบริเวณที่ถอนฟัน ดังนั้นทันตแพทย์มักจะสั่งจ่ายยาแก้ปวดชนิดกินเพื่อบรรเทาอาการดังกล่าว โดยทั่วไปแล้วจะต้องกินยาแก้ปวดเป็นเวลาประมาณ 3-5 วันหลังถอนฟัน หรือจนกว่าอาการปวดและบวมจะทุเลา แต่ควรทานตามคำแนะนำของทันตแพทย์ หลังถอนฟันในช่วงแรกๆนั้น มักจะเจ็บปวดและบวมบริเวณรอบๆแผล ทันตแพทย์จึงมักจะสั่งยาแก้ปวดชนิดกินเพื่อบรรเทาอาการดังกล่าว เช่น พาราเซตามอล อิบูโพรเฟน เป็นต้น",
        "Technical": "กรณีถอนฟันแล้วการทำรากฟันเทียมหรือไม่ขึ้นอยู่กับสถานการณ์หากเป็นการถอนฟันซี่เดียวอาจไม่จำเป็นต้องทำรากฟันเทียมแต่ถ้าเป็นการถอนฟันหลายซี่ ทันตแพทย์อาจแนะนำให้ทำรากฟันเทียมเพื่อทดแทนฟันที่ถอนออกไป โดยทั่วไปไม่จำเป็นต้องงดอาหารก่อนถอนฟันแต่ควรหลีกเลี่ยงอาหารที่มีกากแข็งๆในช่วงสองสามชั่วโมงก่อนนัด ก่อนถอนฟันต้องแปรงฟันให้สะอาดและงดสูบบุหรี่ชั่วคราว ข้อห้ามก่อนการถอนฟันเช่น ไม่ควรดื่มแอลกอฮอล์ก่อนถอนฟัน งดยาต้านการแข็งตัวของเลือดบางชนิดตามคำแนะนำของทันตแพทย์ ทั่วไปมักไม่จำเป็นต้องใส่ฟันปลอมทันทีหลังถอนฟันหากเป็นการถอนฟันซี่เดียว อย่างไรก็ตามหากเป็นการถอนฟันหลายซี่ทันตแพทย์อาจแนะนำให้ใส่ฟันปลอมเพื่อทดแทนฟันที่ถูกถอนออกเนื่องจากจะช่วยบดเคี้ยวได้ดีขึ้น และป้องกันไม่ให้ฟันอื่นๆ เคลื่อนตัว ในกรณีที่ฟันผุยังไม่รุนแรงมากนักสามารถกรอบริเวณที่ผุออกแล้วอุดฟันได้เพื่อหลีกเลี่ยงการถอนฟันแต่หากฟันผุมากเกินไปอาจจำเป็นต้องถอนฟันเพื่อป้องกันปัญหาเรื้อรัง หากกัดผ้าก๊อซแล้วยังมีเลือดซึมออกมาให้นำผ้าก๊อซชิ้นใหม่มากดที่บริเวณแผลถอนฟันประมาณ30นาทีหากเลือดยังไม่หยุดอาจต้องกลับไปพบทันตแพทย์เพื่อรับการรักษาต่อ หลังถอนฟันควรกัดผ้าก๊อซให้แน่นที่บริเวณแผลเป็นเวลาประมาณ1ชั่วโมงเพื่อให้เลือดแข็งตัวและหยุดไหล ไม่จำเป็นต้องเปลี่ยนผ้าก๊อซบ่อยนัก แต่หากผ้าก๊อซเปื้อนเลือดมากก็ควรเปลี่ยนใหม่ทุก1-2ชั่วโมงจนกระทั่งเลือดหยุดไหล ไม่ควรใส่รีเทนเนอร์ในช่วงแรกหลังถอนฟันประมาณ1-2วันเนื่องจากอาจกดทับบริเวณแผลได้ควรรอจนแผลเริ่มแห้งก่อนแล้วจึงค่อยใส่รีเทนเนอร์ตามปกติ อาหารที่ควรหลีกเลี่ยงก่อนถอนฟันเช่น อาหารแข็ง อาหารร้อนจัด อาหารที่เป็นกรด เครื่องดื่มกาแฟ เครื่องดื่มแอลกอฮอล์",
        "Post-Procedure Care": "ข้อควรพึงระวังหลังจากถอนฟัน เช่น อย่างัดกระทืบผ้าก๊อซ ให้กัดผ้าก๊อซเบาๆ หลีกเลี่ยงการดูดหรือการบ้วนปากแรงๆในวันแรก ข้อควรระวังหลังถอนฟันมีอะไรบ้าง กัดผ้าก๊อซที่บริเวณแผลเบาๆ นาน 30-60 นาที เพื่อช่วยหยุดเลือด ใช้ผ้าเย็นประคบบริเวณแก้มเพื่อลดบวมในวันแรกหลังถอนฟัน แปรงฟันตามปกติแต่ระวังไม่ให้ถูกบริเวณแผลโดยตรง รับประทานยาแก้ปวดและยาปฏิชีวนะตามคำแนะนำของทันตแพทย์ ในการดูแลแผลหลังการถอนฟันควรรักษาความสะอาดช่องปากตามปกติแต่ระวังบริเวณแผล แนะนำให้ประคบเย็นในช่วง24ชั่วโมงแรกหลังถอนฟันโดยใช้ถุงน้ำแข็งหรือผ้าเปียกเย็นประคบบริเวณแก้มด้านนอกเพื่อลดอาการบวมและปวด หลังจากนั้นจึงค่อยสลับไปประคบด้วยความร้อนเพื่อบรรเทาอาการปวดเรื้อรัง หลังถอนฟัน6-8ชั่วโมงแรกไม่ควรรับประทานอาหารแข็งเนื่องจากอาจทำให้เกิดเลือดออกและแผลฉีกขาดได้ หลังจากนั้นสามารถรับประทานข้าวหรืออาหารอ่อนนุ่มได้ ในช่วง24ชั่วโมงแรกควรหลีกเลี่ยงการแปรงฟันในบริเวณแผล แต่ให้แปรงฟันได้ตามปกติในบริเวณอื่นหลังจากนั้นก็สามารถแปรงได้ตามปกติ แต่ต้องระมัดระวังไม่ให้แปรงถูกบริเวณแผลโดยตรง ไม่ควรดื่มเครื่องดื่มแอลกอฮอล์หลังถอนฟันทันที เนื่องจากแอลกอฮอล์จะทำให้ร่างกายขาดน้ำ ชะลอการหายของแผล และเพิ่มความเสี่ยงต่อการติดเชื้อ แนะนำควรงดดื่มแอลกอฮอล์อย่างน้อย3วันหลังถอนฟัน หลังถอนฟันในช่วง24ชั่วโมงแรกไม่ควรดื่มน้ำร้อนหรือรับประทานอาหารร้อนเนื่องจากอาจทำให้เกิดการบาดเจ็บต่อแผล และเสี่ยงต่อการติดเชื้อ หลังจาก24ชม.แล้วสามารถดื่มน้ำอุ่นๆได้ แต่ควรระวังไม่ให้ร้อนจนเกินไป หลังถอนฟันควรงดรับประทานอาหารรสเผ็ดร้อนประมาณ3-5วันเนื่องจากจะทำให้บริเวณแผลระคายเคืองและชักนำให้เกิดการติดเชื้อได้ง่าย หลังถอนฟัน24ชั่วโมงแรกไม่ควรแปรงฟันบริเวณแผลเพื่อป้องกันการฉีกขาดของแผลและการติดเชื้อ สามารถแปรงฟันบริเวณอื่นได้ตามปกติ หลังจากนั้นสามารถแปรงได้ทุกบริเวณ แต่ต้องระมัดระวังและแปรงเบามือที่บริเวณแผล ถอนฟันแล้วไม่ควรกินอาหารร้อนหรือเผ็ดเนื่องจากบริเวณที่ถอนฟันจะมีแผลเปิดและสัมผัสกับความร้อนหรือรสเผ็ดจะทำให้เกิดการระคายเคือง ปวด บวม และเสี่ยงต่อการติดเชื้อมากขึ้นจึงควรหลีกเลี่ยงอาหารประเภทนี้ชั่วคราวหลังถอนฟัน วิธีการป้องกันการติดเชื้อหลังถอนฟันคือรับประทานยาปฏิชีวนะตามคำสั่งของทันตแพทย์ รักษาความสะอาดบริเวณแผลด้วยการบ้วนปากด้วยน้ำเกลือเป็นประจำ งดสูบบุหรี่และดื่มแอลกอฮอล์ชั่วคราว หลีกเลี่ยงการใช้หลอดดูดของเหลวหรือให้ลมรั่วผ่านบริเวณแผล วิธีลดความปวดหลังถอนฟันคือรับประทานยาแก้ปวดตามคำสั่งของทันตแพทย์ เวลาในการฟื้นตัวหลังการถอนฟัน ระยะเวลาเฉลี่ยในการฟื้นตัวคือประมาณ3-4วัน หลังจากนั้นอาการปวดและบวมควรทุเลา แต่แผลใช้เวลาหายสนิทประมาณ2สัปดาห์ หลังถอนฟันถ้ามีเลือดออกในปากควรจะกลืนหรือบ้วนทิ้ง หากเลือดไม่หยุดซึมออกมานานเกิน30นาทีควรรีบกลับไปพบทันตแพทย์เพื่อตรวจสอบและรักษาต่อ",
        "Risk-Related": "การถอนฟันมีความเสี่ยงในการติดเชื้อ เลือดออกมาก และบาดเจ็บเนื้อเยื่อรอบฟัน การถอนฟันมีผลกระทบด้านการสูญเสียฟัน อาจทำให้ฟันเคลื่อนตัว และส่งผลต่อการบดเคี้ยวอาหาร การถอนฟันสามารถทำให้เกิดปัญหาการติดเชื้อ เลือดออกมาก บาดเจ็บเนื้อเยื่อ และฟันเคลื่อนตัวได้ การถอนฟันไม่ได้อันตรายมากนัก แต่มีความเสี่ยงบางประการหากไม่ได้รับการดูแลที่ถูกต้อง อาจทำให้เกิดการติดเชื้อ เลือดออกมาก บาดเจ็บเนื้อเยื่อ หรือแม้แต่กระดูกขากรรไกรหัก ปัญหาที่พบได้บ่อยภายหลังการถอนฟัน ได้แก่ การติดเชื้อบริเวณรอยถอน เลือดออกไม่หยุด บาดเจ็บ/อักเสบเนื้อเยื่อโดยรอบ และฟันข้างเคียงเคลื่อนตัว หลังจากถอนฟันสามารถพบอาการข้างเคียง เช่น บวม ปวด เจ็บ เลือดออก คลำได้รอยถอนฟัน รสเลือดในปาก ฟันข้างเคียงเคลื่อนตัว เป็นต้น",
        "Procedure Related": "การถอนฟันกรามซี่เดียวใช้เวลาประมาณ20-40นาที ถ้าเป็นฟันล่างที่มีรากฟันใหญ่ อาจใช้เวลานานกว่า 1 ชั่วโมง จะมีความปวดระหว่างการถอนฟัน แม้จะฉีดยาชาเข้าไปแล้ว แต่ผู้ป่วยอาจยังรู้สึกถึงแรงกดหรือดึง รวมถึงความไม่สบายในระหว่างถอนฟัน แต่โดยทั่วไปจะไม่รู้สึกปวดระหว่างการรักษา การถอนฟันมีความจำเป็นมากน้อยขนาดไหน: การถอนฟันมีความจำเป็นมากน้อยขนาดไหน การตัดสินใจถอนฟันขึ้นอยู่กับสภาพของฟันและสุขภาพช่องปากโดยรวม หากสามารถอนุรักษ์ฟันไว้ได้โดยการอุด ครอบ หรือขูดหินปูนก็ควรเลือกทางเลือกนี้ก่อน แต่ถ้าฟันผุมากเกินไป ฟันหัก หรือโรคปริทันต์รุนแรง การถอนฟันก็เป็นทางเลือกสุดท้าย ขั้นตอนการถอนฟัน ฉีดยาชาเฉพาะที่ ใช้คีมคู่หนีบจับยึดฟันให้แน่น แล้วขยับฟันเพื่อคลายรากฟันออกจากเบ้าฟัน ดึงฟันขึ้นทีละน้อย โดยระวังอย่าให้ฟันแตกหัก ทำความสะอาดเนื้อเยื่อบริเวณที่มีการถอนฟัน กดผ้าก๊อซที่บริเวณแผลเพื่อหยุดเลือด ไม่แนะนำให้ถอนฟันเองเพราะจะทำให้เกิดความเสี่ยงต่อการบาดเจ็บ เลือดออกมาก รากฟันหัก หรือเกิดการติดเชื้อได้ การถอนฟันควรทำโดยผู้เชี่ยวชาญภายใต้สภาวะที่ถูกสุขลักษณะเท่านั้น",
        "Symptom Related": "กลิ่นปากเหม็นหลังถอนฟันเกิดจากการติดเชื้อและเศษอาหารค้างในรอยถอนฟัน หากไม่ดูแลรักษาความสะอาดอย่างถูกวิธี ทันตแพทย์จะแนะนำให้ถอนฟันเมื่อฟันเสียจนซ่อมแซมไม่ได้แล้ว หรือเป็นภัยต่อฟันอื่นๆเพื่อป้องกันปัญหาเพิ่มมากขึ้น สาเหตุที่ต้องถอนฟันมีหลายประการ เช่น ฟันผุรุนแรง ปริทันต์อักเสบ ฟันคุด ฟันเบียดกันมาก เพื่อรักษาโรคในช่องปาก เพื่อการจัดฟัน หรือเตรียมการใส่ฟันปลอม แผลถอนฟันจะเจ็บประมาณ 3-4 วันแรกจากนั้นความเจ็บปวดจะค่อยๆลดลง แม้จะปวดฟันไม่จำเป็นต้องถอนฟันทักที หากยังรักษาหรือซ่อมฟันได้ควรพยายามรักษาฟันให้คงอยู่ก่อน แผลถอนฟันจะแห้งและหายเป็นแผลเป็นประมาณ 7-10 วัน หากดูแลรักษาความสะอาดเรียบร้อย ต้องถอนฟันเมื่อฟันผุลามไปจนถึงรากฟัน หรือมีการอักเสบที่รุนแรง ซ่อมแซมไม่ได้แล้ว"
    },
    "ผ่าฟันคุด" : {
        "General Health": "การถอนฟันคุดมีข้อดีเช่นช่วยแก้ปัญหาให้ฟันคุดที่เสียหายหรือมีปัญหาสุขภาพอื่นๆเช่นการป้องกันการติดเชื้อและอาการปวด การถอนฟันคุดมีประโยชน์ในการแก้ไขปัญหาฟันคุดและสุขภาพช่องปาก การถอนหรือผ่าฟันคุดมีความจำเป็นเมื่อฟันคุดมีปัญหาที่ไม่สามารถแก้ไขได้ด้วยวิธีการรักษาอื่น การผ่าฟันคุดคือกระบวนการที่นำฟันคุดออกจากกระดูกฟัน การผ่าฟันคุดอาจมีข้อเสียเช่นมีอาการปวดและบวมบริเวณแก้มด้านที่ทำการผ่าตัด การผ่าฟันคุดสามารถช่วยลดอาการปวดเมื่อฟันคุดมีปัญหาได้ การผ่าฟันคุดสามารถป้องกันและลดความเสี่ยงต่างๆที่เป็นสาเหตุของโรคช่องปากได้โดยการกำจัดแหล่งสะสมเชื้อโรคและปัญหาที่อาจก่อให้เกิดโรคช่องปาก บางคนต้องถอนฟันคุดเนื่องจากฟันคุดมีปัญหาที่ไม่สามารถแก้ไขได้ด้วยวิธีการรักษาอื่น ช่วงอายุที่เหมาะสมในการผ่าฟันคุดคือ18-25ปี การผ่าฟันคุดโดยปกติใช้เวลาประมาณ20-45นาทีขึ้นอยู่กับความยากง่าย บางคนไม่ต้องถอนหรือผ่าฟันคุดเนื่องจากฟันคุดเจริญเติบโตอย่างปกติและไม่มีปัญหาสุขภาพ ปกติฟันคุดมี 4 ซี่ ผ่าฟันคุดอาจเจ็บได้ตามกระบวนการและสภาพร่างกายของแต่ละบุคคล ผ่าฟันคุดอาจทำให้เกิดแผลขนาดใหญ่หรือไม่ขึ้นอยู่กับวิธีการผ่าและสภาพร่างกาย ฟันคุดเกิดขึ้นจากการเจริญเติบโตของฟันในช่วงวัยรุ่น ฟันคุดต้องถอนหรือผ่าเป็นไปตามความเหมาะสมและความเสี่ยงที่เกิดขึ้นในแต่ละบุคคลและสภาพฟันของแต่ละบุคคล อายุที่ต้องผ่าฟันคุดอาจแตกต่างกันไปโดยแต่ละบุคคลและสภาพฟันแต่ละบุคคล",
        "Medication Related": "การถอนหรือการผ่าฟันคุดอาจต้องฉีดยาชาเพื่อลดความรู้สึกไม่สบายและประสาทขณะทำการรักษา ปวดฟันคุดสามารถระงับได้โดยการกินยาแก้ปวดที่แพทย์หรือทันตแพทย์สั่งได้ หากผ่าฟันคุดกินยาแก้ปวดแล้วไม่หายควรปรึกษาแพทย์หรือทันตแพทย์เพื่อการวินิจฉัยและการรักษาที่เหมาะสม จำนวนเข็มยาชาที่ใช้ในการผ่าฟันคุดขึ้นอยู่กับสภาพและความต้องการของผู้ป่วย ปากจะหายชาหลังผ่าฟันคุดประมาณ1-2ชั่วโมงหลังการผ่าฟัน วิธีระงับอาการปวดฟันคุดได้โดยการใช้ยาแก้ปวดที่แพทย์หรือทันตแพทย์สั่งหรือใช้วิธีการปฏิบัติตามคำแนะนำจากแพทย์ หลังผ่าฟันคุดอาจต้องกินยาแก้ปวดตามคำแนะนำของแพทย์หรือทันตแพทย์จนกว่าอาการปวดจะดีขึ้น",
        "Technical": "ก่อนผ่าฟันคุดต้องงดอาหารและเครื่องดื่ม6-8ชั่วโมงก่อนการผ่าตัดเพื่อป้องกันการสำลักระหว่างการผ่าตัด ก่อนผ่าฟันคุดต้องแจ้งแพทย์ถ้ามีโรคประจำตัวหรือกินยารักษาโรคเพื่อประเมินความเสี่ยง หลังผ่าฟันคุดต้องกัดผ้าก๊อซแน่นๆเพื่อหยุดเลือดออกไว้1-2ชั่วโมงและต้องเปลี่ยนใหม่ทุก30นาที ในบางกรณีหลังผ่าฟันคุดแล้วสามารถใส่ฟันปลอมทับได้ตามคำแนะนำของทันตแพทย์ หลังการผ่าฟันคุดสามารถใส่รีเทนเนอร์ได้ตามปกติ หลังผ่าฟันคุด7-14วันจะต้องมาพบแพทย์เพื่อตัดไหม ไหมละลายจะละลายและหลุดออกไปเองประมาณ2-3สัปดาห์หลังผ่าตัด",
        "Post-Procedure Care": "การฟื้นตัวหลังถอนฟันคุดใช้เวลาประมาณ1-2สัปดาห์ ขึ้นอยู่กับการหายของแผลและสภาพร่างกาย ข้อควรพึงระวังหลังจากผ่าฟันคุดเช่นหลีกเลี่ยงการดื่มเครื่องดื่มร้อนหรือกินของร้อนจัด,งดสูบบุหรี่หรือดื่มแอลกอฮอล์,ระวังอย่าให้แผลโดนกระแทก ควรแปรงฟันบริเวณใกล้แผลเบาๆ ขจัดคราบสกปรกออกจากปากด้วยน้ำเกลือเป็นประจำ ข้อห้ามหลังการผ่าฟันคุดคือเหลียกเลี่ยงการกินร้านจัดหรือเย็นจัด,งดสูบบุหรี่,ดื่มแอลกอฮอล์ หลังผ่าฟันคุดควรดูแลรัดษาความสะอาดบริเวณที่ผ่าฟันคุด ล้างปากด้วยน้ำเกลืออุ่นหลังแปรงฟัน ไม่ควรแคะหรือจ้วงแผล นวดเบาๆรอบๆแผลจะช่วยลดบวม สามารถแปรงฟันได้ตามปกติแต่ต้องระวังตรงบริเวณแผล ผ่าฟันคุดแล้วไม่ควรดื่มแอลกอฮอล์เนื่องจะเพิ่มความเสี่ยงต่อการบวมเลือดออกมากและแผลหายช้า หลังผ่าฟันคุดไม่ควรสูบบุหรี่,เคี้ยวขนมหรือดื่มของร้อนจัดเพราะจะทำให้แผลหายช้า หลังผ่าฟันคุดสามารถกินอาหารอ่อนๆและควรหลีกเลี่ยงของร้อนจัดและรสเผ็ด หลังผ่าฟันคุดควรประคบเย็นในวันแรกๆและหลังจากนั้นอาจประคบร้อน ประคบเย็นช่วยลดอาการบวมและปวด ประคบร้อนเพื่อบรรเทาอาการปวดได้ หลังผ่าฟันคุดสามารถออกกำลังกายเบาๆได้ อาการข้างเคียงที่สามารถพบได้หลังจากผ่าฟันคุดเช่นมีไข้,มีอาการปวดบวม2-3วันหรือมีการติดเชื้อหลังการ หลังผ่าฟันคุดควรงดกินข้าว1-2ชั่วโมง หลังผ่าฟันคุดไม่ควรทานอาหารหรือเครื่องดื่มร้อน ช่วง1-2อาทิตย์แรกหลังผ่าตัด อาหารที่ควรกินคืออาหารอ่อนที่เคี้ยวได้ง่ายและไม่เผ็ดจัดหรือร้อนจัด อาหารที่ควรหลีกเลี่ยงเมื่อผ่าฟันคุดคืออาหารแข็ง,มีเส้นใย,กรอบ,หรือมีเมล็ดเล็กๆเพราะอาจติดหรือทำให้แผลเจ็บได้ หากมีเลือดไหลไม่หยุดควรไปพบแพทย์  วิธีแก้อาการปวดคือสามารถกินยาแก้ปวดได้และประคบเย็นบริเวณที่ปวด หากกินยาแก้ปวดแล้วอาการไม่ดีขึ้นควรไปพบแพทย์",
        "Risk-Related": "การถอนฟันคุดมีอันตรายหรือความเสี่ยงจากการผ่าฟันคุดนั้นอยู่ในระดับต่ำ ความเสี่ยงที่น่าจะเกิดถ้าไม่ถอนฟันคุดเช่นอาการปวดเรื้อรังหรือรู้สึกไม่สบาย เนื่องจากแรงดันของฟันคุด ฟันยื่น ฟันเก กระดูกรอบรากฟัน หรือรากฟันข้างเคียงถูกทำลาย หากแผลผ่าตัดฟันคุดติดเชื้อจะสามารถสังเกตได้จากการเกิดหนองออกมาบริเวณแผล ฟันคุดที่อยู่ใกล้กับเส้นประสาทอาจเป็นอันตรายได้ ปัจจัยเสี่ยงใดที่ทำให้ฟันคุดเกิดอาการอักเสบคือเชื้อแบคทีเรียที่มาสะสมอยู่ ปัจจัยเสี่ยงที่ทำให้ฟันคุดต้องถอนเช่นเหงือกในบริเวณที่ปกคลุมฟันคุดอักเสบหรือมีการติดเชื้อหรือเกิดฟันผุที่ฟันกรามซี่ข้างเคียง หากหลังได้รับการผ่าฟันคุดเป็นเวลา2ชั่วโมงแล้วสังเกตุได้ว่าเลือดไหลไม่หยุดถือว่าไหลมากควรไปพบแพทย์ หากมีอาการชาบริเวณที่ผ่าหลังผ่าฟันคุดควรทานวิตามิน B1-6-12 ช่วยบำรุงเส้นประสาท หลังผ่าฟันคุดมีหนองต้องไปพบทันตแพทย์ทันที หลังผ่าฟันคุดอาจมีโอกาสติดเชื้อได้หากดูแลรักษาความสะอาดแผลไม่ดีพอ",
        "Procedure Related": "การถอนฟันคุดเป็นกระบวนการรักษาฟันคุดในกรณีฟันคุดโผล่ขึ้นมาทั้งซี่เรียบร้อยแล้ว การผ่าฟันคุดโดยปกติใช้เวลาประมาณ20-45นาทีขึ้นอยู่กับความยากง่าย ขั้นตอนการผ่าฟันคุดคือใส่ยาชา รอจนยาออกฤทธิ์,ผ่าตัดเปิดเหงือก,ถอนฟันคุดออกและเย็บปิดปากแผล ความแตกต่างระหว่างถอนฟันคุดกับผ่าฟันคุดคือการถอนฟันคุดถือเป็นการถอนฟันตามปกติ ถ้าฟันกรามซี่ในเป็นฟันคุดไม่สามารถขึ้นมาในช่องปากได้ต้องทำการผ่าฟันคุด การผ่าฟันคุดมีขั้นตอนยากกว่าการถอนฟันคุด ฟันคุดไม่จำเป็นต้องผ่าเสมอถ้าฟันคุดนั้นขึ้นตามตามธรรมชาติอย่างปกติและเต็มซี่สามารถถอนออกได้ ฟันคุดแบบที่ต้องผ่าคือฟันคุดทั้งซี่ฝังตัวอยู่ภายใต้กระดูกขากรรไกรและยังไม่โผล่พ้นเหงือก ฟันคุดประเภทนี้จะขึ้นมาเองไม่ได้  โดยปกติฟันคุดจะผ่าที่ละซี่ขึ้นอยู่กันการพิจารณาของแพทย์ ฟันคุดไม่แนะนำให้ผ่าพร้อมกันทั้ง4ซี่ควรผ่าครั้งละ2ซี่ในข้างเดียวกัน",
        "Symptom Related": "การดูแลที่ไม่ดีเป็นสาเหตุหลักของปัญหาฟันคุดเกิดจากการดูแลสุขภาพช่องปากที่ไม่ดีเช่นแปรงฟันไม่สะอาด ทำให้เกิดคราบจุลินทรีย์สะสมจนเกิดการอักเสบที่รากฟัน นำไปสู่ปัญหาฟันคุด การถอนฟันคุดมีสาเหตุจากการอักเสบของเนื้อเยื่อรอบรากฟัน เกิดจากการสะสมของคราบจุลินทรีย์และขี้ผึ้ง หากปล่อยทิ้งไว้อาจทำให้เกิดรูรั่วระหว่างรากฟันและกระดูกรองรับฟัน ฟันคุดต้องถอนในบางกรณีเพราะการรักษาด้วยวิธีอื่นไม่ได้ผลเช่นเมื่อฟันถูกทำลายมากจนไม่สามารถรักษาด้วยการขูดรากฟันหรือผ่าตัดฟันคุดได้ บางครั้งหลังจากถอนฟันคุดแล้ว ผลข้างเคียงที่อาจเกิดขึ้นได้หลังผ่าฟันคุดได้แก่บวมแดง,ปวด,เลือดออก,ไข้เล็กน้อย,อาจเจ็บศีรษะ,คลื่นไส้หรือมีไข้สูง อาการข้างเคียงมักจะดีขึ้นภายใน 3-4 วัน ปวดฟันคุดกินยาช่วยได้สามารถรับประทานยาแก้ปวดชนิดที่ไม่ใช่สเตียรอยด์ได้ตามคำแนะนำของทันตแพทย์ โดยปกติเลือดจะไหลซึมช้าๆในช่วง24ชั่วโมงแรกและลดลงจนหยุดสนิท  ถ้าเลือดยังไหลนานเกิน 24 ชม.ควรปรึกษาทันตแพทย์ ผ่าฟันคุดแล้วหน้าบวมเป็นเรื่องปกติ เนื่องจากการผ่าตัดทำให้เกิดการบาดเจ็บของเนื้อเยื่ออ่อนในบริเวณนั้น ทำให้เกิดอาการบวมชั่วคราว แผลผ่าฟันคุดใช้เวลาประมาณ7-10วันกว่าจะแห้ง ขึ้นอยู่กับสภาพร่างกาย ปริมาณการสูญเสียเลือด และความสามารถในการหายของแผล ฟันคุดโดยปกติจะหายปวดประมาณ12-24ชั่วโมงหลังการผ่าตัด แต่อาจใช้เวลานานถึง 3 วันในบางราย ไม่ปวดฟันคุดไม่จำเป็นต้องถอนหากยังไม่มีอาการรุนแรง ทันตแพทย์อาจพิจารณารักษาด้วยวิธีอื่นเช่นการขูดหินปูน หรือรักษารากฟันก่อน ลักษณะของอาการปวดฟันคุดอาจปวดตุบๆปวดร้าวไปที่แก้มและใบหน้า ปวดมากขึ้นเมื่อกดที่เหงือก มีหนองไหลออกจากบริเวณเหงือก วิธีสังเกตการเกิดฟันคุดสังเกตบริเวณเหงือกบวม แดง มีหนองหรือเลือดไหลออกมาจากรอบๆ ฟัน มีกลิ่นปากเหม็น อาจปวดตุบๆ หรือปวดร้าวไปที่แก้ม ความรู้สึกเสียวฟันหลังผ่าฟันคุดเป็นเรื่องปกติ เนื่องจากการผ่าตัดทำให้เกิดการระคายเคืองหรือกระทบกระเทือนกับเนื้อเยื่ออ่อน รากฟัน และเส้นประสาทบริเวณนั้น อาการเสียวฟันมักจะค่อยๆ ดีขึ้นภายใน1-2 สัปดาห์ การมีกลิ่นปากหลังผ่าฟันคุดเป็นเรื่องปกติเนื่องจากแผลที่เปิดอาจมีคราบสกปรกหรือเลือดค้างอยู่  อาการหลังผ่าฟันคุดที่ควรไปพบแพทย์เช่นปวดบวมมากผิดปกติ และไม่ดีขึ้นภายใน 3-4 วัน มีเลือดออกมากผิดปกติ ไม่สามารถเปิดปากได้เต็มที่ หรือขากรรไกรติด"
    },
    "ผ่าตัดเหงือก" : {
        "General Health": "ผ่าตัดเหงือกคือการผ่าตัดเพื่อรักษาโรคเหงือกอักเสบเพื่อสร้างเส้นใยเหงือกเอ็นยึดและกระดูกเบ้าฟันที่แข็งแรง การขูดหินปูนช่วยรักษาโรคปริทันต์ได้ การทำความสะอาดช่องปากและฟันอย่างถูกวิธีร่วมกับการใช้ไหมขัดฟันบริเวณซอกฟันทุกครั้งรวมถึงเลิกสูบบุหรี่ช่วยป้องกันป้องกันการเกิดโรคปริทันต์ได้ การผ่าตัดเหงือกสามารถแก้ไขปัญหาเหงือกอักเสบได้ ข้อจำกัดในกาผ่าตัดเหงือกเช่น ความเสี่ยงสูงสุดของการตัดเหงือกคือหรือการติดเชื้อทั้งในเหงือกเองหรือการติดเชื้อไปยังอวัยวะอื่นๆ ข้อดีของการผ่าตัดเหงือกคือช่วยแก้ปัญหาเกี่ยวกับโรคเหงือกเช่นเหงือกร่น, เหงือกติดเชื้อ, เหงือกอักเสบ, ปัญหาร่องเหงือกลึก, และเหงือกบาดเจ็บ การทำความสะอาดช่องปากอย่างสม่ำเสมอจะสามารถป้องกันตัวเองจากโรคเหงือก เด็กสามารถเป็นโรตปริทันต์ได้เฉพาะในเด็กที่ไม่สามารถควบคุมระดับน้ำตาลในเลือดได้ดี การขูดหินปูนช่วยลดโอกาสการเกิดโรคเหงือกได้ หลังรักษาโรคเหงือกหายแล้วยังต้องมาพบทันตแพทย์เป็นประจำเพื่อติดตามอาการ ปลูกถ่ายเหงือกมีค่าใช้จ่ายประมาณ 3,000 - 5,000 บาท ให้ทานพาราเซตามอลเพื่อบรรเทาอาการปวด ปลูกเหงือกเหมาะกับผู้ที่มีฟันซี่ที่ดูยาวขึ้นจากอาการเหงือกร่น, ผู้ที่มีอาการเสียวฟันจากอาการเหงือกร่น, ผู้ที่เป็นโรคปริทันต์อักเสบหรือโรคเหงือกจนเกิดอาการเหงือกร่น ปัจจัยที่อาจทำให้เกิดโรคปริทันต์อักเสบมีผลอย่างเด่นชัดคือโรคเบาหวานและการสูบบุหรี่ ผ่าตัดเหงือกช่วยบรรเท่าการอักเสบได้ ผ่าตัดเหงือกแผลมีขนาดเล็ก ผ่าตัดเหงือกแล้วจะสามารถงอกกลับมาใหม่ได้หากไม่ได้กรอกระดูกฟัน แผลจากผ่าตัดเหงือกหายภายใน2–4สัปดาห์ หลังผ่าตัดเหงือกสามารถกินข้าวได้ปกติแต่หลีกเลี่ยงของร้อนและเผ็ด โรคปริทันต์สามารถกลับมาเป็นใหม่ได้เสมอถ้าดูแลฟันไม่ถูกต้อง โรคปริทันต์สามารถรักษาให้หายได้ โรคเหงือกอักเสบคือการอักเสบของเหงือกที่สามารถพัฒนาไปเป็นการติดเชื้อที่กระดูกที่ยึดติดฟันและบริเวณใกล้เคียง ผ่าตัดเหงือกผ่าจะทำตอนอายุเท่าไหร่ก็ได้ ความแตกต่างโรคปริทันต์อักเสบและโรคเหงือกอักเสบต่างกันที่ความรุนแรกซึ่งโรคปริทันต์จะรุนแรงมากกว่า ปลูกเหงือกเป็นการผ่าตัดปลูกถ่ายเนื้อเยื่อบริเวณรากฟันที่หายไปจากอาการเหงือกร่นโดยการนำเนื้อเยื่อจากบริเวณรอบฟันมาใช้ ปลูกเหงือกไม่เจ็บเนื่องจากระหว่างการผ่าตัดจะมีการฉีดยาชาแต่หลังจากการรักษาอาจมีอาการเจ็บ",
        "Medication Related": "การผ่าตัดเหงือกต้องฉีดยาชาอยู่แล้ว ผ่าตัดเหงือกต้องใช้ยาชากี่เข็ม1เข็มหรือมากกว่าขึ้นอยู่กับผู้ป่วย หลังผ่าเหงือกแล้วต้องกินยาแก้ปวดประมาณ3-7วัน หลังผ่าตัดเหงือกต้องยาให้ครบตามที่แพทย์สั่ง โดยทั่วไปยาชาจะออกฤทธิ์ประมมาณ2-4ชั่วโมง",
        "Technical": "ก่อนผ่าตัดเหงือกต้องงดกินข้าวอย่างน้อย6ชั่วโมง สิ่งที่ต้องเตรียมตัวก่อนผ่าตัดเหงือกเช่นหากมีโรคประจำตัวหรือมียาที่ทานประจำรวมถึงการสูบบุหรี่ควรปรึกษาแพทย์ก่อนเริ่มทำการรักษา ต้องตัดไหมหลังจากผ่าเหงือกประมาณ1-2อาทิตย์ ปลูกเหงือกมี3แบบคือการปลูกถ่ายเนื้อเยื่อยึดต่อและการปลูกถ่ายแผ่นเหงือกอิสระและการปลูกถ่ายเหงือกแบบเลื่อนแผ่นเหงือก ผ่าตัดเหงือกต้องมีการตัดไหมโดยทันตแพทย์จะนัดตัดไหมหลังจากวันผ่าตัดประมาณ1-2อาทิตย์ ผ่าตัดเหงือกแล้วไม่ควรใส่ฟันปลอมในช่วงแรกเนื่องจากจะไปรบกวนการหายของแผล ทำให้แผลอักเสบติดเชื้อได้ ผ่าตัดเหงือกแล้วต้องกัดผ้าก๊อซให้แน่นพอสมควรราว 1 ชั่วโมง ผ่าตัดเหงือกแล้วสามารถจัดฟันได้ซึ่งขึ้นกับวัตถุประสงค์ของการรักษาการตัดแต่งเหงือกในขั้นตอนขณะนั้น",
        "Post-Procedure Care": "การดูแลตัวเองหลังปลูกเหงือกเช่นต้องรับประทานอาหารอ่อนๆ,พยายามหลีกเลี่ยงบริเวณที่เป็นแผลจากการรักษา,ไม่เคี้ยวอาหารใกล้แผล,ไม่ดึงริมฝีปาก,และไม่เอาลิ้นไปสัมผัสบริเวณแผลอยู่บ่อยๆ ข้อควรพึงระวังหลังจากผ่าตัดเหงือกคือ หลีกเลี่ยงการสูบบุหรี่ภายหลังการผ่าตัดโดยเฉพาะ48ชั่วโมงแรกหลังจากการผ่าตัดเพราะจะส่งผลกระทบต่อการหายของแผลโดยตรง หลังผ่าตัดเหงือกไม่ควรดื่มแอลกอฮอล์เพราะจะทำให้แผลติดเชื้อได้ การแปลงฟันหลังผ่าเหงือกทำการแปรงแบบปัดจากเหงือกไปหาฟันในลักษณะการปัดขึ้น(ในฟันล่าง)และปัดลง(ในฟันบน) ผ่าตัดเหงือกควรกินข้าวต้ม,โจ๊ก,เต้าหู้ไข่,ไข่ตุ๋น(อาหารอ่อน) ผ่าตัดเหงือกใช้เวลาหายสนิทประมาณ2-4อาทิตย์ ผ่าตัดเหงือกแล้วควรหลีกเลี้ยงการเคี้ยวของแข็ง ผ่าตัดเหงือกแล้วควรงดออกกำลังกายประมาณ48ชั่วโมงหลังจากการผ่าตัด ผ่าตัดเหงือกห้ามกินอาหารรสจัดช่วงเเรกๆควรจะงดอาารที่มีรสเผ็ดร้อน, งดเคี้ยวของเเข็งหรือขนมกรุบกรอบ วิธีลดความปวดหลังผ่าตัดเหงือกให้ประคบอุ่นโดยการประคบ 20 นาทีและหยุดพัก 20 นาที หลังการผ่าตัดเหงือกควรรับประทานยาที่แพทย์สั่งให้ครบถ้วนเพื่อป้องกันการติดเชื้อ",
        "Risk-Related": "การผ่าตัดมีความเสี่ยงที่ค่อนข้างน้อยมาก การผ่าตัดเหงือกมีความเสี่ยงในการติดเชื้อยังสามารถเกิดขึ้นได้เสมอ การผ่าตัดเหงือกมีอันตรายไม่อันตราย หลังผ่าตัดเหงือกอาจจะเกิดปัญหาในการติดเชื้อจากการดูแลที่ไม่ดี แผลที่ติดเชื้อจะมีหนองออกมาบริเวณแผลและมีอาการปวดนานและผิดปกติและอาจมีไข้ร่วมด้วย เนื่องจากเครื่องมือทันตกรรมที่ใช้เป็นเครื่องมือทันสมัยที่ใช้สำหรับตัดแต่งเหงือกโดยเฉพาะจึงไม่ต้องกังวลว่าจะมีผลกระทบอะไรตามมาจากการผ่าตัดเหงือก ถ้าไม่ผ่าตัดเหงือกจะเกิดปัญหาเช่นเหงือกที่มีปัญหาอาจก่อให้เกิดการติดเชื้อได้ง่ายขึ้นเนื่องจากเหงือกเป็นที่อยู่ของแบคทีเรียและสิ่งสกัดอื่นๆ ทำไมบุหรี่จึงทำให้โรคเหงือกรุนแรงขึ้นเพราะบุหรี่ทำให้เนื้อเยื่อเหงือกไม่แข็งแรงโดยเฉพาะความสามารถ การยึดเกาะคอฟันและกระดูกจะลดลง ปัจจัยเสี่ยงที่ทำให้เกิดโรคปริทันต์อักเสบเกิดจากการสะสมของเศษอาหารและเซลล์เยื่อบุจากการแปรงฟันไม่สะอาด ผ่าตัดเหงือกแล้วจะเลือดไหลไม่หยุดห้ามอมน้ำแข็งแต่ควรใช้น้ำแข็งห่อผ้าหรือเจลเย็น,ประคบนอกปากบริเวณที่ถอนฟันหรือบริเวณแผลผ่าตัด",
        "Procedure Related": "การผ่าตัดรักษาโรคปริทันต์หรือผ่าตัดเหงือกใช้เวลานานประมาณ1-2ชั่วโมง ขั้นตอนการผ่าตัดเหงือกคือฉีดยาชา,กำหนดจุดที่จะตัดเหงือก,ผ่าตัดตามแต่ละวิธีที่เลือกใช้เช่นใบมีดหรือเครื่องเลเซอร์เพื่อตัดเหงือกส่วนเกินออกและเย็บปิดปากแผล ปลูกเหงือกใช้เวลานานประมาณ 1-2 ชั่วโมง ผ่าตัดเหงือกต้องทำแค่ครั้งเดียวแต่จะต้องติดตามอาการภายหลัง",
        "Symptom Related": "อาจจะมีอาการบวมบริเวณที่ผ่าตัดได้เล็กน้อย ซึ่งไม่ใช่อาการที่ผิดปกติหลังการผ่าตัดเหงือก ถ้าเป็นโรคปริทันต์ควรจะพบแพทย์เพื่อทำการรักษาทันทีเพราะถ้าทิ้งไว้นานๆจะมีปัญหาเกี่ยวกับเหงือกและช่องปากในอนาคตได้ ถ้ามีอาการบวมหรืออาการปวดหลังการผ่าตัดเหงือกควรประคบน้ำแข็งที่บริเวณที่จะทำการผ่าตัด สาเหตุที่ต้องผ่าตัดเหงือกเพื่อรักษาโรคต่างๆเกี่ยวกับเหงือก ผลข้างเคียงหลังการผ่าเหงือกเช่นมีความเป็นไปได้ที่จะเกิดการติดเชื้อในบริเวณแผลผ่าตัดหรือในช่องปากหลังการผ่าตัด ผ่าตัดเหงือกจะหายภายใน2–4สัปดาห์ ผ่าตัดเหงือกแล้วอาจพบเลือดออกเล็กน้อยภายในช่วง48ชั่วโมงแรกหลังการผ่าตัด อาการและผลข้างเคียงของการผ่าตัดเหงือกเช่นความเจ็บปวดหลังผ่าตัด, เลือดออก, และการติดเชื้อยังสามารถเกิดขึ้นได้เสมอ โรคปริทันต์เกิดขึ้นจากแผ่นคราบจุลินทรีย์ที่สะสมอยู่บนตัวฟันจากการแปรงฟันไม่สะอาด โรคปริทันต์มีอาการคือเหงือกมีสีแดง,บวม,มีอาการปวด,อาจมีหนองที่เหงือกเป็นๆหายๆได้"
    },
    "ผ่าตัดรากฟันเทียม" : {
        "General Health": "รากฟันเทียมวัสดุที่ใช้ทดแทนรากฟันที่หลุดออกไปมีลักษณะคล้ายกับน็อตหรือสกรูฝังลงไปในกระดูกขากรรไกรจุดที่สูญเสียรากฟัน กระบวนผ่ารากเทียมใช้เวลาประมมาณ3-6เดือนต่างกันไปตามสภาพการณ์แต่ละบุคคล การทำรากเทียมไม่เจ็บเพราะจะมีการใช้ยาชาเฉพาะที่แต่จะมีอาการเจ็บปวดภายหลังการผ่าตัดมากน้อยขึ้นอยู่กับลักษณะสันกระดูก การผ่าตัดรากเทียมกับการรักษารากฟันไม่เหมือนกันโดยการผ่าตัดรากเทียมต้องมีการผ่าตัดเอารากเก่าออกและใส่รากฟันใหม่ทดแทนแต่การรักษารากฟันคือการรักษารากที่ยังมีอยู่ การรักษารากฟันเทียมภายใน1วันคือการถอนฟันแล้วใส่รากเทียมรวมถึงทำครอบฟันแบบชั่วคราวเลยในวันนั้น ผ่าตัดรากฟันเทียมใช้เวลาพักฟื้นเพียง1-2วันก็จะเริ่มหายเจ็บ ข้อจำกัดในการรักษารากฟันเทียมเช่นกรณีที่สูญเสียฟันไปเป็นระยะเวลานึงเเละจะมีอาการกระดูกขากรรไกรยุบหรือกระดูกละลายตัวและการทำรากเทียมอาจได้ฟันปลอมที่ไม่สวยเหมือนธรรมชาติ ข้อดีของรากฟันเทียมคือมีลักษณะคล้ายฟันธรรมชาติมากไม่ต้องอาศัยฟันข้างเคียงเป็นหลักยึดต่างกับการทำสะพานฟันซึ่งต้องมีการกรอฟันข้างเคียงเพื่อใช้เป็นหลักยึดและมีการสูญเสียเนื้อฟันข้างเคียง ข้อเสียของการใส่รากฟันเทียมมีอาจเกิดการติดเชื้อบริเวณที่ใส่รากฟันเทียมอาจเกิดการบาดเจ็บหรือเสียหายรอบโครงสร้างช่องปากเช่นฟันซี่อื่นๆหรือเส้นเลือด รากฟันเทียมสามารถช่วยเพิ่มความมั่นใจให้ผู้ที่สูญเสียฟันได้จากการทนแทนฟันที่สูญเสียไปและช่วยลดโอกาศเกิดฟันล้ม ค่าใช้จ่ายทั้งหมดสำหรับการทำรากฟันเทียมประมาณ35,000-100,000บาท ผู้ที่ควรจะต้องรักษารากฟันเทียมคือผู้ที่ต้องการใส่ฟันเพียงซี่เดียวโดยฟันข้างเคียงยังอยู่ในสภาพดีหรือผู้ที่ใส่ฟันปลอมทั้งปากแต่ประสบกับปัญหากระดูกขากรรไกรล่างยุบตัวลงมาก ถ้าถอนฟันออกแล้วสามารถฝังรากฟันเทียมได้ทันทีหลังถอนฟัน ต้องทำรากฟันเทียมเมื่อมีการสูญเสียฟันแล้วไม่ได้ทำการรักษาเช่นโรครากฟันเสื่อมสภาพหรือฟันถูกขาด ข้อเปรียบเทียบรากฟันเทียม-สะพานฟัน-ฟันปลอมทั้งหมดนี้เป็นการแก้ไขปัญหาฟันหายซึ่งควรปรึกษากับทันตแพทย์เพื่อเลือกวิธีที่เหมาะสมที่สุด ผู้สูงอายุสามารถผ่ารากฟันเทียมได้ ฟันที่ได้รับการรักษารากฟันจะอยู่ได้นานอย่างน้อย5-10ปี ส่วนมากฟันผุที่ผุลึกมากเป็นสาเหตุที่ทำให้รากฟันอักเสบจนกระทั่งทะลุโพรงประสาทฟัน ซึ่งจะอยู่ในส่วนของรากฟัน หากมีโรคประจำตัวสามารถทำรากเทียมได้ บุคคลที่มีโรคประจำตัวโรคเบาหวานชนิดรุนแรงหรือโรคกระดูกพรุนไม่สามารถฝังรากฟันเทียมได้ รักษารากฟันจัดเทียมคือใส่รากฟันใหม่ลงไปแทนรากอันเดิม รักษารากฟันเทียมเหมาะกับคนไข้ที่สูญเสียฟันเเท้โดยเฉพาะอย่างยิ่งฟันที่อยู่บริเวณด้านหน้า หรือฟันที่ไม่สามารถใช้ฟันซี่อื่นๆบริเวณข้างๆได้ รากเทียมทำแล้วอยู่ได้นานมากกว่า20ปี รากฟันเทียมดีกว่าฟันปลอมคือมีจุดเด่นหลักตรงที่มีความใกล้เคียงกับฟันจริงมากที่สุด รากฟันเทียมทำมาจากวัสดุไททาเนียม รากฟันเทียมมี4แบบคือรากฟันเทียมเดี่ยวและรากฟันเทียมหลายช่องและรากฟันเทียมทั้งชุดและรากฟันเทียมแบบเทคนิคเดียว บุคคลที่อายุ18ปีขึ้นไปสามารถผ่าตัดรากฟันเทียมได้ ผ่าตัดรากฟันเทียมไม่แนะนำให้ทำในเด็กที่อายุต่ำกว่า18ปีหรือบุคคลที่มีอายุมากแล้วหรือบุคคลที่มีโรคประจำตัว อาจมีผลกระทบต่อการทำรากฟันเทียมในกรณีผู้ที่มีความเสี่ยงจะฝังรากฟันเทียมไม่ได้หรือมีโอกาสสำเร็จต่ำ บุคคลที่มีการสูญเสียฟันและไม่ต้องการใส่ฟันปลอมแบบถอดได้สามารถทำรากฟันเทียมได้ รากฟันเทียมอักเสบสามารถป้องกันได้",
        "Medication Related": "ผ่าตัดรากฟันเทียมใช้ยาชาด้วย ผ่าตัดรากฟันเทียมอาจใช้ยาชาหรือยาสลบแต่ส่วนมากมักใช้แค่ยาชา ผ่ารากฟันเทียมใช้ยาชากี่เข็มจะขึ้นอยู่กับประเภทของยาชาที่หมอใช้ ปากจะหายชาหลังผ่ารากฟันเทียมประมาณ1-2ชั่วโมงหลังการผ่า วิธีระงับอาการปวดแผลได้โดยการใช้ยาแก้ปวดที่แพทย์หรือทันตแพทย์สั่งหรือใช้วิธีการปฏิบัติตามคำแนะนำจากแพทย์ หลังผ่ารากฟันเทียมจะต้องกินยาแก้ตามคำแนะนำของแพทย์หรือทันตแพทย์",
        "Technical": "ก่อนผ่าตัดรากฟันเทียมมีสิ่งที่ต้องคำนึงบ้างเช่นหากมีประวัติการแพ้ยากรุณาแจ้งให้ทันตแพทย์ทราบ ก่อนผ่าผ่าตัดรากฟันเทียมต้องงดกินข้าวกี่ชั่วโมงอย่างน้อย6ชั่วโมง การใช้การกรอหรือการอุดฟันเพื่อแทนการรักษารากฟันเมื่อมีปัญหาเช่นเสื่อมสภาพหรือเสีย อาจเป็นทางเลือกที่เหมาะสมในบางกรณีแทนการรักษารากฟัน ต้องตัดไหมหลังจากผ่ารากฟันเทียม1สัปดาห์ บริเวณที่ผ่าตัดรากฟันเทียมดูแลโดยการควรแปรงฟันให้สะอาดทั่วปากยกเว้นบริเวณผ่าตัดและใช้ก้านสำลีชุบน้ำยาC-20เช็ดบริเวณแผลและตามด้วยฉีดล้างด้วยน้ำเกลือครั้งละ4หลอดฉีดหลังการแปรงฟันและก่อนนอน รักษารากฟันจัดฟันสามารถจัดฟันได้ปกติ หลังผ่ารากฟันเทียมประมาณ14วันจะต้องมาพบแพทย์เพื่อตัดไหม หลังผ่ารากฟันเทียมต้องกัดผ้าก๊อซแน่นๆเพื่อหยุดเลือดออกไว้1-2ชั่วโมงและต้องเปลี่ยนใหม่ทุก30นาที",
        "Post-Procedure Care": "การดูแลฟันที่รักษารากเทียมสามารถดูแลได้เหมือนกับการดูแลรักษาฟันธรรมชาติ หลังผ่าตัดรากฟันเทียมควรกินอาหารอ่อนหลีกเลี่ยงอาหารเครื่องคืมที่มีรสจัดและร้อน,ประคบเย็นและกินยาตามที่แพทย์สั่งให้ครบถ้วน ข้อควรพึงระวังหลังจากทำการรักษารากฟันเทียมเช่นหลีกเลี่ยงการรับประทานอาหารแข็ง การทำรากฟันเทียมจึงไม่ควรสูบบุหรี่เพื่อลดการติดเชื้อภายในช่องปาก หลังผ่ารากฟันเทียมสามารถแปรงฟันได้ตามปกติ ผ่าตัดรากฟันเทียมใช้เวลาพักฟื้นเพียง1-2วัน ผ่าตัดรากฟันเทียมสามารถกินอาหารอ่อนในช่วงสัปดาห์แรก ผ่ารากฟันเทียมแล้วควรหลีกเลี่ยงการเคี้ยวของแข็ง ช่วงแรกหลังผ่าตัดรากฟันเทียมควรกินอาหารเหลว สามารถกินอาหารอ่อนหลังจาก1อาทิตย์หลังผ่าตัดได้ หลังผ่าตัดรากฟันเทียมหลีกเลี่ยงการดื่มน้ำร้อนในช่วง24-48ชั่วโมงแรกหลังการผ่าตัด หลังผ่าตัดรากฟันเทียมควรประคบเย็นด้านนอกช่องปากตรงกับบริเวณผ่าตัดครั้งละ15นาทีเว้น15นาทีใน48ชั่วโมงแรก หลังผ่าตัดรากฟันเทียมควรประคบเย็นในวันแรกๆและหลังจากนั้นอาจประคบร้อน ประคบเย็นช่วยลดอาการบวมและปวด ประคบร้อนเพื่อบรรเทาอาการปวดได้ หลังผ่าตัดรากฟันเทียมห้ามดื่มสุราและของมึนเมาหรือรับประทานของรสจัดหรือเผ็ดจัดและห้ามสูบบุหรี่ หลังผ่าตัดรากฟันแล้วมีอาการปวดควรรับประทานยาแก้ปวดแต่ถ้าอาการไม่ดีขึ้นให้รีบกลับมาพบทันตแพทย์ทันที กัดผ้าก๊อซแน่นๆเพื่อหยุดเลือดออกไว้1-2ชั่วโมงและต้องเปลี่ยนใหม่ทุก30นาที หลีกเลี่ยงการออกกำลังกายหลังการผ่าตัด",
        "Risk-Related": "ความเสี่ยงของการทำรากฟันเทียมคือปัญหาเลือดไหลไม่หยุดหรือการบาดเจ็บเส้นประสาท กระดูกขากรรไกรหักหรือการทะลุหรือฉีกขาดของเนื้อเยื่อบุ ถ้าไม่รักษารากฟันอาการจะปวดลามขึ้นหน้าหรือเชื้อลุกลามมากขึ้น ถ้ารากฟันเทียมอักเสบต้องพบทันตแพทย์เพื่อทำความสะอาดบริเวณรากฟันเทียมอย่างสม่ำเสมอ ผ่าตัดรากฟันเทียมมีความเสี่ยงต่อผู้สูงถ้ามีโรคเบาหวานหรือหลอดเลือดหัวใจอาจทำให้ความสำเร็จต่ำ หลังจากได้รับการรักษารากฟันเทียมอาจมีอาการแทรกซ้อนเช่นการสูญเสียรากฟันเทียมหรือกระดูกที่เติมลงไปจากการติดเชื้อแบคทีเรียหรืออาจเพราะรับแรงมากเกินไป และอาจพบผลต่อเส้นประสาทรับความรู้สึกหรือฟันข้างเคียงอยู่บ้างแต่ไม่มากนัก รักษารากฟันไม่อันตราย หากแผลจากการผ่ารากฟันเทียมติดเชื้อจะมีการอักเสบเป็นหนองหรือฟันเทียมโยก",
        "Procedure Related":"กระบวนผ่ารากเทียมใช้เวลาประมมาณ3-6เดือนต่างกันไปตามสภาพการณ์แต่ละบุคคล ขั้นตอนการทำรากฟันเทียมคือถ่ายภาพX-RayและCT-Scanแล้วจึงผ่าตัดฝังรากฟันเทียมในตำแหน่งที่เหมาะสม ในบางกรณีอาจมีการเสริมกระดูกก่อนและรอให้กระดูกยึดกับรากฟันเทียมซึ่งใช้เวลาประมาณ2-3เดือน พิมพ์ปากเพื่อทำสะพานฟันหรือครอบฟันหรือฟันปลอมและใส่เดือยฟันเพื่อรองรับสะพานฟันหรือครอบฟัน หรือฟันปลอมใส่สะพานฟันหรือครอบฟันหรือฟันปลอม ผ่าตัดรากฟันเทียมแบ่งการรักษาเป็น2ครั้งโดยครั้งแรกจะใส่รากฟันเทียมไปในกระดูกรองรับรากฟันและครั้งที่2จะทำในส่วนของการใส่ฟันบนรากฟันเทียมที่มีการยึดกระดูกแล้ว ผ่าตัดรากฟันเทียมไม่จำเป็นต้องทำทีละซี่ ค่าใช้จ่ายการทำรากฟันเทียมจะแตกต่างกันไปในแต่ละยี่ห้ออาจมีราคาตั้งแต่30,000-90,000บาท",
        "Symptom Related": "การทำรากฟันเทียมมีผลข้างเคียงคืออาจเจ็บฟันข้างเคียงหรือมีอาการชาหรือมีเลือดออกที่โพรงจมูก มีหนองบริเวณฟันเหงือกริมฝีปากหรือลิ้นและมีไข้ร่วมด้วยหรือรู้สึกว่าตัวรากเทียมโยก ผ่าตัดรากฟันเทียมอาจมีการเลือดออกเป็นปกติจากการผ่าตัดซึ่งเป็นเรื่องปกติ ผ่ารากฟันเทียมแล้วแผลจะบวมประมาณ1สัปดาห์ รักษารากฟันแล้วรู้สึกปวดรอบๆเป็นอาการปกติที่เกิดขึ้นโดยเฉพาะหลังจากรักษารากฟันครั้งแรก รากฟันเทียมอักเสบเกิดจากอะไรได้บ้างการติดเชื้อแบคทีเรียเป็นสาเหตุที่พบได้บ่อยที่สุดของรากฟันเทียมอักเสบ รากฟันอักเสบมักมีอาการปวดฟันขึ้นมาเองอาจปวดแบบเป็นๆหายๆหรือปวดรุนแรงจนนอนไม่หลับ สีขาวๆในช่องปากหลังผ่าตัดรากฟันเทียมคือหนองที่เกิดจากการติดเชื้อ หลังผ่าตัดรากฟันเทียมต้องกัดผ้าก๊อซนาน1ชั่วโมง หลังผ่าตัดรากฟันเทียมมีกลิ่นปากเหม็นเป็นเรื่องปกติ หลังผ่าตัดรากฟันเทียมแล้วจะปวดแผลประมาณ1-2วัน"
    }
}

def send_followup():
    print("Sending follow-up")
    for user in mongo.db.users.find():
        
        if 'records' not in user:
            continue
        
        if len(user['records']) == 0:
            continue
        else:
            contents = []
            for record in user['records']:
                if record['surgicalstatus'] != 'Done':
                    if record['surgicalstatus'] == 'Follow Up':
                        mongo.db.users.update_one({ "records._id":  record['_id'] }, { '$set': { "records.$.surgicalstatus": "Pending" } })
                        
                    if record['surgicalprocedure'] == "ถอนฟัน":
                        url = "https://tu.ac.th/uploads/news-tu/news/2566/oct/66-1349r.jpg"
                    elif record['surgicalprocedure'] == "ผ่าฟันคุด":
                        url = "https://www.smiledelightclinic.com/wp-content/uploads/2023/08/wisdom-tooth-768x553.jpg"
                    elif record['surgicalprocedure'] == "ผ่าตัดเหงือก":
                        url = "https://media.istockphoto.com/id/998246150/fi/vektori/s%C3%B6p%C3%B6-sarjakuvahammashahmo-jolla-on-purukumiongelma.jpg?s=612x612&w=0&k=20&c=zfJMQm8-ZB3Prw2eE4AijftQyRHXQbmm8_7_hW8SXG0="
                    elif record['surgicalprocedure'] == "ผ่าตัดรากฟันเทียม":
                        url = "https://www.si.mahidol.ac.th/sidoctor/sirirajonline2021/Article_images/1482_0.jpg"
                    
                    contents.append({
                        "type": "bubble",
                        "size": "micro",
                        "hero": {
                            "type": "image",
                            "url": url,
                            "size": "full",
                            "aspectMode": "cover",
                            "aspectRatio": "320:213"
                        },
                        "body": {
                            "type": "box",
                            "layout": "vertical",
                            "contents": [
                            {
                                "type": "text",
                                "text": record['surgicalprocedure'],
                                "weight": "bold",
                                "size": "sm",
                                "wrap": True
                            },
                            {
                                "type": "box",
                                "layout": "horizontal",
                                "contents": [
                                {
                                    "type": "text",
                                    "text": "Date:",
                                    "wrap": True,
                                    "color": "#8c8c8c",
                                    "size": "xs",
                                    "scaling": False,
                                    "flex": 1
                                },
                                {
                                    "type": "text",
                                    "text": record['surgicaldate'].strftime("%d/%m/%Y"),
                                    "flex": 3,
                                    "size": "sm"
                                }
                                ],
                                "flex": 1
                            },
                            {
                                "type": "button",
                                "action": {
                                "type": "message",
                                "label": "Follow Up",
                                "text": f"Record ID: {record['_id']}"
                                }
                            }
                            ],
                            "spacing": "sm",
                            "paddingAll": "13px"
                        }
                        })
            
            if len(contents) > 0:
                try:
                    requests.post('https://api.line.me/v2/bot/message/push',
                            headers={'Content-Type': 'application/json', 'Authorization' : f'Bearer bnuW8Pa848Dfhp37AA0II+V8EYcHNGjc5IwlNhvoxLzUmMW1FoKA/xWjaLpRibuRCemzQSXWKLeMTS02UXXViLX/7Fpj1iZiqpPZyOpZowrLMpCgvT6s1Dt04b9eRR7MbZEKSiMHNJEIARLEfYTx4QdB04t89/1O/w1cDnyilFU='},
                                json = {"to":  user['lineopenid'],
                                        "messages": [{
                                            "type": "flex",
                                            "altText": "Follow-up reminder",
                                            "contents": {
                                                "type": "carousel",
                                                "contents": contents
                                            }
                                        }]
                                    })
                    print("Follow-up sent to user", user['lineopenid'], user['lineusername'])
                except Exception as e:
                    print("Error sending follow-up to user", user['lineopenid'], user['lineusername'], e)

scheduler = BackgroundScheduler()
scheduler.configure(timezone=pytz.timezone('Asia/Bangkok'))
job = scheduler.add_job(send_followup, 'cron', hour=10)
scheduler.start()

def keyword_Search3(question):
    returnClass = []
    question = question.lower()
    question = question.replace('?', '')
    question = question.replace(' ', '')
    
    class_0_regex = r'(?!.*(.).*\1)[ถอนฟัน]{6}|ถ.นฟัน|ถอ.ฟัน|ถอน.น|อนฟัน|ถนฟัน|ถอฟัน|ถอนฟั|ถ.อนฟัน|ถอ.นฟัน|ถอน.ฟัน|ถอนฟั.น|ถน|ถ.อน|ถอ.น|ถอน'
    class_1_regex = r'(?!.*(.).*\1)[ฟันคุด]{6}|.นคุด|ฟั.คุด|ฟันคุ.|ฟั.นคุด|ฟัน.คุด|ฟันคุ.ด|ฟัคุด|ฟันคด|ฟนคุด|นคุด|ฟันคุ'
    class_2_regex = r'[เหงือก]{6}|.หงือก|เ.งือก|เห.อก|เหงื.ก|เหงือ.|เ.หงือก|เห.งือก|เหงื.อก|เหงือ.ก|เงือก|เหงอก|เหือก|เหงืก|หงือก|[ปริทันต์]{8}|.ริทันต์|ป.ทันต์|ปริ.นต์|ปริทั.ต์|ปริทัน.|ป.ริทันต์|ปริ.ทันต์|ปริทั.นต์|ปริทัน.ต์|ปรทันต์|ปิทันต์|ปริทนต์|ปริทันต|ปริทัน|ริทันต์'
    class_3_regex = r'(?!การ|รัก|กัน)(?!.*(.).*\1)[รากฟัน]{6}|รกาฟัน|ราฟกัน|ร.กฟัน|รา.ฟัน|ราก.น|รากฟั.|ร.ากฟัน|รา.กฟัน|ราก.ฟัน|รากฟั.น|รกฟัน|ราฟัน|รากน|รากฟั|[รากเทียม]{8}|.ากเทียม|ร.กเทียม|รา.เทียม|ราก.ทียม|รากเ.ยม|รากเที.ม|รากเทีย.|ร.ากเทียม|รา.กเทียม|ราก.เทียม|รากเ.ทียม|รากเที.ยม|รากเทีย.ม|ากเทียม|รกเทียม|รากทียม|รากเยม|รากเทีม|ากฟันเทียม'
    
    if re.search(class_1_regex, question):
        returnClass.append(1)
    
    if re.search(class_0_regex, question) and not re.search(class_1_regex, question):
        returnClass.append(0)
    
    if re.search(class_2_regex, question):
        returnClass.append(2)
    
    if re.search(class_3_regex, question):
        returnClass.append(3)
        
    if len(returnClass) != 1:
        returnClass = [-1]
        
    return returnClass[0]

@app.route("/")
def home():
    return "Model Server is running on port 5000."

@app.route("/line", methods=["POST"])
def line():
    body_json = request.get_json()
    app.logger.info(body_json)
    
    try: 
        if 'message' in body_json['events'][0]:
            if body_json['events'][0]['message']['text'][0:10] == 'Record ID:' or body_json['events'][0]['message']['text'] == 'ไม่' or body_json['events'][0]['message']['text'] == 'ใช่' or body_json['events'][0]['message']['text'] == '0' or body_json['events'][0]['message']['text'] == '1' or body_json['events'][0]['message']['text'] == '2' or body_json['events'][0]['message']['text'] == '3' or body_json['events'][0]['message']['text'] == '4' or body_json['events'][0]['message']['text'] == '5' or body_json['events'][0]['message']['text'] == '6' or body_json['events'][0]['message']['text'] == '7' or body_json['events'][0]['message']['text'] == '8' or body_json['events'][0]['message']['text'] == '9' or body_json['events'][0]['message']['text'] == '10' or body_json['events'][0]['message']['text'] == '11' or body_json['events'][0]['message']['text'] == '12' or body_json['events'][0]['message']['text'] == '13' or body_json['events'][0]['message']['text'] == '14' or body_json['events'][0]['message']['text'] == '15' or body_json['events'][0]['message']['text'] == '16' or body_json['events'][0]['message']['text'] == '17' or body_json['events'][0]['message']['text'] == '18' or body_json['events'][0]['message']['text'] == '19' or body_json['events'][0]['message']['text'] == '20' or body_json['events'][0]['message']['text'] == '21' or body_json['events'][0]['message']['text'] == '22' or body_json['events'][0]['message']['text'] == '23' or body_json['events'][0]['message']['text'] == '24' or body_json['events'][0]['message']['text'] == '25' or body_json['events'][0]['message']['text'] == '26' or body_json['events'][0]['message']['text'] == '27' or body_json['events'][0]['message']['text'] == '28' or body_json['events'][0]['message']['text'] == '29' or body_json['events'][0]['message']['text'] == '30' or body_json['events'][0]['message']['text'] == '31':
                requests.post('https://bots.dialogflow.com/line/f3211ca9-d9fb-4baf-a4d8-b97b22a11ab9/webhook',
                    headers={'Host': 'bots.dialogflow.com','Content-Type': 'application/json'}, 
                    json = body_json)
            else:
                handle_message(body_json)
        else:
            requests.post('https://bots.dialogflow.com/line/f3211ca9-d9fb-4baf-a4d8-b97b22a11ab9/webhook',
                headers={'Host': 'bots.dialogflow.com','Content-Type': 'application/json'}, 
                json = body_json)
            
    except Exception as e:
        app.logger.error(e)
        abort(400)

    return 'OK'

def query(payload):
    response = requests.post("https://api-inference.huggingface.co/models/timpal0l/mdeberta-v3-base-squad2", 
                            headers={"Authorization": "Bearer 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"}, 
                            json=payload)
    return response.json()    

def handle_message(body_json):
    operation = keyword_Search3(body_json['events'][0]['message']['text'])
    
    user = mongo.db.users.find_one({"lineopenid": body_json['events'][0]['source']['userId']})
    
    if user is None:
        user = mongo.db.users.insert_one({"lineopenid": body_json['events'][0]['source']['userId']})
        user_id = user.inserted_id
    else:
        user_id = user["_id"]
    
    if operation == -1:
        requests.post('https://api.line.me/v2/bot/message/reply',
                  headers={'Content-Type': 'application/json', 'Authorization' : f'Bearer {dotenv.get_key("../.env","CHANNEL_ACCESS_TOKEN")}'},
                    json = { "replyToken":  body_json['events'][0]['replyToken'],
                            "messages": [{"type": "text", "text": "Sorry, Please specify the operation(ถอนฟัน, ผ่าฟันคุด, ผ่าตัดเหงือก, ผ่าตัดรากฟันเทียม) in the question."}]
                })
        mongo.db.faqchathistories.insert_one({
            "user": user_id, 
            "chattext": body_json['events'][0]['message']['text'], 
            "chatreply": "Sorry, Please specify the operation(ถอนฟัน, ผ่าฟันคุด, ผ่าตัดเหงือก, ผ่าตัดรากฟันเทียม) in the question.",
            "chattime": datetime.datetime.now()
        })
        return

    data = vectoriser.transform([body_json['events'][0]['message']['text']])
    prediction = model.predict(data)
    
    output = query({
        "inputs": {
            "question": body_json['events'][0]['message']['text'],
            "context":  contexts[Olabel[operation]][Qlabel[prediction[0]]],
        },
    })

    requests.post('https://api.line.me/v2/bot/message/reply',
                  headers={'Content-Type': 'application/json', 'Authorization' : f'Bearer {dotenv.get_key("../.env","CHANNEL_ACCESS_TOKEN")}'},
                    json = { "replyToken":  body_json['events'][0]['replyToken'],
                            "messages": [{"type": "text", "text": output['answer']}]
                })

    mongo.db.faqchathistories.insert_one({
        "user": user_id, 
        "chattext": body_json['events'][0]['message']['text'], 
        "chatreply": output['answer'],
        "chattime": datetime.datetime.now()
    })
    
    return

@app.route("/predict", methods=["POST"])
def predict():
    
    data = request.json
    input_text = data['question']
    
    operation = keyword_Search3(input_text)
    
    if operation == -1:
        return  {'answer': "Sorry, Please specify the operation(ถอนฟัน, ผ่าฟันคุด, ผ่าตัดเหงือก, ผ่าตัดรากฟันเทียม) in the question."}

    data = vectoriser.transform([input_text])
    prediction = model.predict(data)
    
    output = query({
        "inputs": {
            "question": input_text,
            "context":  contexts[Olabel[operation]][Qlabel[prediction[0]]],
        },
    })

    return {'question': input_text, 'operation': Olabel[operation], 'question_type': Qlabel[prediction[0]], 'answer': output['answer'], 'score': output['score']}

if __name__ == "__main__":
    context = ('../certificates/localhost.pem', '../certificates/localhost-key.pem')
    app.run(host=dotenv.get_key("../.env","REACT_APP_DNS_NAME"), port=dotenv.get_key("../.env","MODEL_PORT"),debug = True,ssl_context=context)